src/rust/generic.org
** 在函数定义中使用泛型
   当使用泛型定义函数时，在 _函数签名_ 中通常为 _参数_ 和 _返回值_ 指定数据类型的位置放置泛型
   
   #+BEGIN_EXAMPLE
   以这种方式编写的代码将更灵活并能向函数调用者提供更多功能，同时不引入重复代码
   #+END_EXAMPLE
   
   回到 largest 函数上，下面展示了两个提供了相同的寻找 slice 中最大值功能的函数：
   
   #+BEGIN_SRC rust 
  fn largest_i32(list: &[i32]) -> i32 {
      let mut largest = list[0];

      for &item in list.iter() {
          if item > largest {
              largest = item;
          }
      }

      largest
  }

  fn largest_char(list: &[char]) -> char {
      let mut largest = list[0];

      for &item in list.iter() {
          if item > largest {
              largest = item;
          }
      }

      largest
  }

  fn main() {
      let number_list = vec![34, 50, 25, 100, 65];

      let result = largest_i32(&number_list);
      println!("The largest number is {}", result);

      let char_list = vec!['y', 'm', 'a', 'q'];

      let result = largest_char(&char_list);
      println!("The largest char is {}", result);
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   largest_i32 函数是前面提取的寻找 slice 中 i32 最大值的函数
   
   largest_char 函数寻找 slice 中 char 的最大值
   
   这两个函数有着相同的代码，所以在一个单独的函数中引入泛型参数来消除重复
   #+END_EXAMPLE
   
   为了参数化要定义的函数的签名中的类型，需要像给函数的值参数起名那样为 _这类型参数_ 起一个 *名字* 
   
   #+BEGIN_EXAMPLE
   任何标识符都可以作为类型参数名
   
   不过选择 T 是因为 Rust 的习惯是让变量名尽量短，通常就只有一个字母
   
   同时 Rust 类型命名规范是骆驼命名法。T 作为 “type” 的缩写是大部分 Rust 程序员的首选
   #+END_EXAMPLE
   
   + 当需要在函数体中使用一个参数时，必须在 _函数签名_ 中 *声明* 这个 _参数_ 以便编译器能知道函数体中这个名称的意义
   + 同理，当在函数签名中使用一个类型参数时，必须在使用它之前就声明它
     
   为了定义泛型版本的 largest 函数， *类型参数声明* 位于 _函数名称_ 与 _参数列表_ 中间的尖括号 _<>_ 中，像这样：
   
   #+BEGIN_SRC rust 
  fn largest<T>(list: &[T]) -> T {
   #+END_SRC
   
   #+BEGIN_EXAMPLE
     这可以理解为：函数 largest 有泛型类型 T：
     1. 它有一个参数 list，它的类型是一个 T 值的 slice
     2. largest 函数将会返回一个与 T 相同类型的值
   #+END_EXAMPLE
   
   下面展示一个在签名中使用了泛型的统一的 largest 函数定义。该示例也向展示了如何对 i32 值的 slice 或 char 值的 slice 调用 largest 函数
   
   #+BEGIN_EXAMPLE
   注意这些代码还不能编译，不过稍后部分会修复错误
   #+END_EXAMPLE
   
   #+BEGIN_SRC rust 
  fn largest<T>(list: &[T]) -> T {
      let mut largest = list[0];

      for &item in list.iter() {
          if item > largest {
              largest = item;
          }
      }

      largest
  }

  fn main() {
      let number_list = vec![34, 50, 25, 100, 65];

      let result = largest(&number_list);
      println!("The largest number is {}", result);

      let char_list = vec!['y', 'm', 'a', 'q'];

      let result = largest(&char_list);
      println!("The largest char is {}", result);
  }
   #+END_SRC
   
   如果现在就尝试编译这些代码，会出现如下错误：
   #+BEGIN_SRC sh 
  error[E0369]: binary operation `>` cannot be applied to type `T`
   --> src/main.rs:5:12
    |
  5 |         if item > largest {
    |            ^^^^^^^^^^^^^^
    |
    = note: an implementation of `std::cmp::PartialOrd` might be missing for `T`
   #+END_SRC
   
   这个错误表明 largest 的函数体不能适用于 T 的所有可能的类型。因为在函数体需要比较 T 类型的值，不过它只能用于我们知道如何排序的类型
   #+BEGIN_EXAMPLE
     注释中提到了 std::cmp::PartialOrd，这是一个 trait：可以实现类型的比较功能
   
     在 “trait 作为参数” 部分会讲解如何指定泛型实现特定的 trait
   #+END_EXAMPLE
