html/rust/generic.html
<div id="outline-container-org93a065e" class="outline-3">
<h3 id="org93a065e">在函数定义中使用泛型</h3>
<div class="outline-text-3" id="text-org93a065e">
<p>
当使用泛型定义函数时，在 <span class="underline">函数签名</span> 中通常为 <span class="underline">参数</span> 和 <span class="underline">返回值</span> 指定数据类型的位置放置泛型
</p>

<pre class="example">
   以这种方式编写的代码将更灵活并能向函数调用者提供更多功能，同时不引入重复代码
</pre>

<p>
回到 largest 函数上，下面展示了两个提供了相同的寻找 slice 中最大值功能的函数：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">largest_i32</span>(<span style="color: #4eee94;">list</span>: &amp;[<span style="color: #98f5ff;">i32</span>]) -&gt; <span style="color: #98f5ff;">i32</span> {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">largest</span> = list[0];

    <span style="color: #00bfff; font-weight: bold;">for</span> &amp;item <span style="color: #00bfff; font-weight: bold;">in</span> list.iter() {
        <span style="color: #00bfff; font-weight: bold;">if</span> item &gt; largest {
            largest = item;
        }
    }

    largest
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">largest_char</span>(<span style="color: #4eee94;">list</span>: &amp;[<span style="color: #98f5ff;">char</span>]) -&gt; <span style="color: #98f5ff;">char</span> {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">largest</span> = list[0];

    <span style="color: #00bfff; font-weight: bold;">for</span> &amp;item <span style="color: #00bfff; font-weight: bold;">in</span> list.iter() {
        <span style="color: #00bfff; font-weight: bold;">if</span> item &gt; largest {
            largest = item;
        }
    }

    largest
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">number_list</span> = <span style="color: #ffd700;">vec!</span>[34, 50, 25, 100, 65];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span> = largest_i32(&amp;number_list);
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The largest number is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, result);

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">char_list</span> = <span style="color: #ffd700;">vec!</span>[<span style="color: #deb887;">'y'</span>, <span style="color: #deb887;">'m'</span>, <span style="color: #deb887;">'a'</span>, <span style="color: #deb887;">'q'</span>];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span> = largest_char(&amp;char_list);
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The largest char is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, result);
}
</pre>
</div>

<pre class="example">
largest_i32 函数是前面提取的寻找 slice 中 i32 最大值的函数

largest_char 函数寻找 slice 中 char 的最大值

这两个函数有着相同的代码，所以在一个单独的函数中引入泛型参数来消除重复
</pre>

<p>
为了参数化要定义的函数的签名中的类型，需要像给函数的值参数起名那样为 <span class="underline">这类型参数</span> 起一个 <b>名字</b> 
</p>

<pre class="example">
   任何标识符都可以作为类型参数名
   
   不过选择 T 是因为 Rust 的习惯是让变量名尽量短，通常就只有一个字母
   
   同时 Rust 类型命名规范是骆驼命名法。T 作为 “type” 的缩写是大部分 Rust 程序员的首选
</pre>

<ul class="org-ul">
<li>当需要在函数体中使用一个参数时，必须在 <span class="underline">函数签名</span> 中 <b>声明</b> 这个 <span class="underline">参数</span> 以便编译器能知道函数体中这个名称的意义</li>
<li>同理，当在函数签名中使用一个类型参数时，必须在使用它之前就声明它</li>
</ul>

<p>
为了定义泛型版本的 largest 函数， <b>类型参数声明</b> 位于 <span class="underline">函数名称</span> 与 <span class="underline">参数列表</span> 中间的尖括号 <span class="underline">&lt;&gt;</span> 中，像这样：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">largest</span>&lt;<span style="color: #98f5ff;">T</span>&gt;(<span style="color: #4eee94;">list</span>: &amp;[<span style="color: #98f5ff;">T</span>]) -&gt; <span style="color: #98f5ff;">T</span> {
</pre>
</div>

<pre class="example">
这可以理解为：函数 largest 有泛型类型 T：
1. 它有一个参数 list，它的类型是一个 T 值的 slice
2. largest 函数将会返回一个与 T 相同类型的值
</pre>

<p>
下面展示一个在签名中使用了泛型的统一的 largest 函数定义。该示例也向展示了如何对 i32 值的 slice 或 char 值的 slice 调用 largest 函数
</p>

<pre class="example">
   注意这些代码还不能编译，不过稍后部分会修复错误
</pre>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">largest</span>&lt;<span style="color: #98f5ff;">T</span>&gt;(<span style="color: #4eee94;">list</span>: &amp;[<span style="color: #98f5ff;">T</span>]) -&gt; <span style="color: #98f5ff;">T</span> {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">largest</span> = list[0];

    <span style="color: #00bfff; font-weight: bold;">for</span> &amp;item <span style="color: #00bfff; font-weight: bold;">in</span> list.iter() {
        <span style="color: #00bfff; font-weight: bold;">if</span> item &gt; largest {
            largest = item;
        }
    }

    largest
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">number_list</span> = <span style="color: #ffd700;">vec!</span>[34, 50, 25, 100, 65];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span> = largest(&amp;number_list);
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The largest number is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, result);

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">char_list</span> = <span style="color: #ffd700;">vec!</span>[<span style="color: #deb887;">'y'</span>, <span style="color: #deb887;">'m'</span>, <span style="color: #deb887;">'a'</span>, <span style="color: #deb887;">'q'</span>];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span> = largest(&amp;char_list);
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The largest char is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, result);
}
</pre>
</div>

<p>
如果现在就尝试编译这些代码，会出现如下错误：
</p>
<div class="org-src-container">
<pre class="src src-sh">error[E0369]: binary operation <span style="color: #fa8072;">`&gt;`</span> cannot be applied to type <span style="color: #fa8072;">`T`</span>
 --&gt; src/main.rs:5:12
  |
5 |         <span style="color: #00bfff; font-weight: bold;">if</span> item &gt; largest {
  |            ^^^^^^^^^^^^^^
  |
  = note: an implementation of <span style="color: #fa8072;">`std::cmp::PartialOrd`</span> might be missing for <span style="color: #fa8072;">`T`</span>
</pre>
</div>

<p>
这个错误表明 largest 的函数体不能适用于 T 的所有可能的类型。因为在函数体需要比较 T 类型的值，不过它只能用于我们知道如何排序的类型
</p>
<pre class="example">
     注释中提到了 std::cmp::PartialOrd，这是一个 trait：可以实现类型的比较功能
   
     在 “trait 作为参数” 部分会讲解如何指定泛型实现特定的 trait
</pre>
</div>
</div>
