src/rust/generic.org
** 结构体定义中的泛型
   同样也可以使用 <> 语法来定义拥有一个或多个 _泛型参数类型字段_ 的结构体。下面展示了如何定义和使用一个可以存放任何类型的 x 和 y 坐标值的结构体 Point：
   
   #+BEGIN_SRC rust 
  struct Point<T> {
      x: T,
      y: T,
  }

  fn main() {
      let integer = Point { x: 5, y: 10 };
      let float = Point { x: 1.0, y: 4.0 };
  }
   #+END_SRC
   其语法类似于函数定义中使用泛型：
   1. 必须在 _结构体名称_ 后面的尖括号中 *声明* _泛型参数的名称_
   2. 在结构体定义中可以 *指定* _具体数据类型的位置_ *使用* _泛型类型_ 
      
   注意 Point<T> 的定义中只使用了一个泛型类型，这个定义表明结构体 Point<T> 对于一些类型 T 是泛型的，而且字段 _x_ 和 _y_ 都是 *相同类型* 的，无论它具体是何类型。如果尝试创建一个有不同类型值的 Point<T> 的实例，像下面的不能编译：
   
   #+BEGIN_SRC rust 
  struct Point<T> {
      x: T,
      y: T,
  }

  fn main() {
      let wont_work = Point { x: 5, y: 4.0 };
  }
   #+END_SRC
   在这个例子中，当把整型值 5 赋值给 x 时，就告诉了编译器这个 Point<T> 实例中的泛型 T 是整型的。接着指定 y 为 4.0，它被定义为与 x 相同类型，就会得到一个像这样的类型不匹配错误：
   
   #+BEGIN_SRC sh 
  error[E0308]: mismatched types
   --> src/main.rs:7:38
    |
  7 |     let wont_work = Point { x: 5, y: 4.0 };
    |                                      ^^^ expected integer, found
  floating-point number
    |
    = note: expected type `{integer}`
               found type `{float}`
   #+END_SRC
   
   如果想要定义一个 x 和 y 可以有不同类型且仍然是泛型的 Point 结构体，可以使用 _多个_ 泛型类型参数。修改 Point 的定义为拥有两个泛型类型 T 和 U。其中字段 x 是 T 类型的，而字段 y 是 U 类型的： 
   
   #+BEGIN_SRC rust 
  struct Point<T, U> {
      x: T,
      y: U,
  }

  fn main() {
      let both_integer = Point { x: 5, y: 10 };
      let both_float = Point { x: 1.0, y: 4.0 };
      let integer_and_float = Point { x: 5, y: 4.0 };
  }
   #+END_SRC
   
   现在所有这些 Point 实例都是被允许的了
   
   #+BEGIN_EXAMPLE
     可以在定义中使用任意多的泛型类型参数，不过太多的话代码将难以阅读和理解
   
     当代码中需要许多泛型类型时，它可能表明代码需要重组为更小的部分
   #+END_EXAMPLE
   
** 枚举定义中的泛型
   类似于结构体， _枚举_ 也可以在其成员中存放泛型数据类型。已经使用过了标准库提供的 Option<T> 枚举：
   #+BEGIN_SRC rust 
  enum Option<T> {
      Some(T),
      None,
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   现在这个定义看起来就更容易理解了。Option<T> 是一个拥有泛型 T 的枚举，它有两个成员：Some，它存放了一个类型 T 的值，和不存在任何值的None
   
   通过 Option<T> 枚举可以表达有一个可能的值的抽象概念，同时因为 Option<T> 是泛型的，无论这个可能的值是什么类型都可以使用这个抽象
   #+END_EXAMPLE
   
   枚举也可以拥有多个泛型类型。使用过的 Result 枚举定义就是一个这样的例子：
   
   #+BEGIN_SRC rust 
  enum Result<T, E> {
      Ok(T),
      Err(E),
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   Result 枚举有两个泛型类型，T 和 E。Result 有两个成员：
   1. Ok，它存放一个类型 T 的值
   2. Err 则存放一个类型 E 的值
   
   这个定义使得 Result 枚举能很方便的表达任何可能成功（返回 T 类型的值）也可能失败（返回 E 类型的值）的操作
   
   前一章中打开一个文件的场景：当文件被成功打开 T 被放入了 std::fs::File 类型而当打开文件出现问题时 E 被放入了 std::io::Error 类型
   #+END_EXAMPLE
   
   当发现代码中有多个只有存放的值的类型有所不同的结构体或枚举定义时，应该像之前的函数定义中那样引入泛型类型来减少重复代码
   
