html/rust/generic.html
<div id="outline-container-orgf12592a" class="outline-3">
<h3 id="orgf12592a">结构体定义中的泛型</h3>
<div class="outline-text-3" id="text-orgf12592a">
<p>
同样也可以使用 &lt;&gt; 语法来定义拥有一个或多个 <span class="underline">泛型参数类型字段</span> 的结构体。下面展示了如何定义和使用一个可以存放任何类型的 x 和 y 坐标值的结构体 Point：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">T</span>,
    <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">T</span>,
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">integer</span> = <span style="color: #98f5ff;">Point</span> { <span style="color: #4eee94;">x</span>: 5, <span style="color: #4eee94;">y</span>: 10 };
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">float</span> = <span style="color: #98f5ff;">Point</span> { <span style="color: #4eee94;">x</span>: 1.0, <span style="color: #4eee94;">y</span>: 4.0 };
}
</pre>
</div>
<p>
其语法类似于函数定义中使用泛型：
</p>
<ol class="org-ol">
<li>必须在 <span class="underline">结构体名称</span> 后面的尖括号中 <b>声明</b> <span class="underline">泛型参数的名称</span></li>
<li>在结构体定义中可以 <b>指定</b> <span class="underline">具体数据类型的位置</span> <b>使用</b> <span class="underline">泛型类型</span></li>
</ol>

<p>
注意 Point&lt;T&gt; 的定义中只使用了一个泛型类型，这个定义表明结构体 Point&lt;T&gt; 对于一些类型 T 是泛型的，而且字段 <span class="underline">x</span> 和 <span class="underline">y</span> 都是 <b>相同类型</b> 的，无论它具体是何类型。如果尝试创建一个有不同类型值的 Point&lt;T&gt; 的实例，像下面的不能编译：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">T</span>,
    <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">T</span>,
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">wont_work</span> = <span style="color: #98f5ff;">Point</span> { <span style="color: #4eee94;">x</span>: 5, <span style="color: #4eee94;">y</span>: 4.0 };
}
</pre>
</div>
<p>
在这个例子中，当把整型值 5 赋值给 x 时，就告诉了编译器这个 Point&lt;T&gt; 实例中的泛型 T 是整型的。接着指定 y 为 4.0，它被定义为与 x 相同类型，就会得到一个像这样的类型不匹配错误：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0308]: mismatched types
 --&gt; src/main.rs:7:38
  |
7 |     <span style="color: #f08080;">let</span> wont_work = Point { x: 5, y: 4.0 };
  |                                      ^^^ expected integer, found
floating-point number
  |
  = note: expected type <span style="color: #fa8072;">`{integer}`</span>
             found type <span style="color: #fa8072;">`{float}`</span>
</pre>
</div>

<p>
如果想要定义一个 x 和 y 可以有不同类型且仍然是泛型的 Point 结构体，可以使用 <span class="underline">多个</span> 泛型类型参数。修改 Point 的定义为拥有两个泛型类型 T 和 U。其中字段 x 是 T 类型的，而字段 y 是 U 类型的： 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">T</span>, <span style="color: #98f5ff;">U</span>&gt; {
    <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">T</span>,
    <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">U</span>,
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">both_integer</span> = <span style="color: #98f5ff;">Point</span> { <span style="color: #4eee94;">x</span>: 5, <span style="color: #4eee94;">y</span>: 10 };
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">both_float</span> = <span style="color: #98f5ff;">Point</span> { <span style="color: #4eee94;">x</span>: 1.0, <span style="color: #4eee94;">y</span>: 4.0 };
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">integer_and_float</span> = <span style="color: #98f5ff;">Point</span> { <span style="color: #4eee94;">x</span>: 5, <span style="color: #4eee94;">y</span>: 4.0 };
}
</pre>
</div>

<p>
现在所有这些 Point 实例都是被允许的了
</p>

<pre class="example">
     可以在定义中使用任意多的泛型类型参数，不过太多的话代码将难以阅读和理解
   
     当代码中需要许多泛型类型时，它可能表明代码需要重组为更小的部分
</pre>
</div>
</div>

<div id="outline-container-org148e898" class="outline-3">
<h3 id="org148e898">枚举定义中的泛型</h3>
<div class="outline-text-3" id="text-org148e898">
<p>
类似于结构体， <span class="underline">枚举</span> 也可以在其成员中存放泛型数据类型。已经使用过了标准库提供的 Option&lt;T&gt; 枚举：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #98f5ff;">Some</span>(<span style="color: #98f5ff;">T</span>),
    <span style="color: #98f5ff;">None</span>,
}
</pre>
</div>

<pre class="example">
   现在这个定义看起来就更容易理解了。Option&lt;T&gt; 是一个拥有泛型 T 的枚举，它有两个成员：Some，它存放了一个类型 T 的值，和不存在任何值的None
   
   通过 Option&lt;T&gt; 枚举可以表达有一个可能的值的抽象概念，同时因为 Option&lt;T&gt; 是泛型的，无论这个可能的值是什么类型都可以使用这个抽象
</pre>

<p>
枚举也可以拥有多个泛型类型。使用过的 Result 枚举定义就是一个这样的例子：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Result</span>&lt;<span style="color: #98f5ff;">T</span>, <span style="color: #98f5ff;">E</span>&gt; {
    <span style="color: #98f5ff;">Ok</span>(<span style="color: #98f5ff;">T</span>),
    <span style="color: #98f5ff;">Err</span>(<span style="color: #98f5ff;">E</span>),
}
</pre>
</div>

<pre class="example">
Result 枚举有两个泛型类型，T 和 E。Result 有两个成员：
1. Ok，它存放一个类型 T 的值
2. Err 则存放一个类型 E 的值

这个定义使得 Result 枚举能很方便的表达任何可能成功（返回 T 类型的值）也可能失败（返回 E 类型的值）的操作

前一章中打开一个文件的场景：当文件被成功打开 T 被放入了 std::fs::File 类型而当打开文件出现问题时 E 被放入了 std::io::Error 类型
</pre>

<p>
当发现代码中有多个只有存放的值的类型有所不同的结构体或枚举定义时，应该像之前的函数定义中那样引入泛型类型来减少重复代码
</p>
</div>
</div>
