src/rust/generic.org
** 方法定义中的泛型
   可以为定义中 *带有泛型* 的 _结构体_ 或 _枚举_ *实现* _方法_ 。下面展示了前面定义的结构体 Point<T>，和在其上实现的名为 x 的方法：
   
   #+BEGIN_SRC rust 
  struct Point<T> {
      x: T,
      y: T,
  }

  impl<T> Point<T> {
      fn x(&self) -> &T {
          &self.x
      }
  }

  fn main() {
      let p = Point { x: 5, y: 10 };

      println!("p.x = {}", p.x());
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   这里在 Point<T> 上定义了一个叫做 x 的方法来返回字段 x 中数据的引用
   #+END_EXAMPLE
   注意：必须在 _impl 后面_ 声明 T，这样就可以在 Point<T> 上实现的方法中使用它了
   
   #+BEGIN_EXAMPLE
   在 impl 之后声明泛型 T ，这样 Rust 就知道 Point 的尖括号中的类型是泛型而不是具体类型
   #+END_EXAMPLE
   
   当然也可以选择为 Point<f32> 实例实现方法，而不是为泛型 Point 实例。下面展示了一个没有在 impl 之后（的尖括号）声明泛型的例子，这里使用了一个具体类型 _f32_ ：
   
   #+BEGIN_SRC rust 
  impl Point<f32> {
      fn distance_from_origin(&self) -> f32 {
          (self.x.powi(2) + self.y.powi(2)).sqrt()
      }
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   这段代码意味着 Point<f32> 类型会有一个方法 distance_from_origin，而其他 T 不是 f32 类型的 Point<T> 实例则没有定义此方法
   
   这个方法计算点实例与坐标 (0.0, 0.0) 之间的距离，并使用了只能用于浮点型的数学运算符
   #+END_EXAMPLE
   
   _结构体定义_ 中的泛型类型参数并 *不总是* 与 _结构体方法签名_ 中使用的泛型是 *同一类型* 。下面实例中 Point<T, U> 上定义了一个方法 mixup。这个方法获取另一个 Point 作为参数，而它可能与调用 mixup 的 self 是不同的 Point 类型。这个方法用 self 的 Point 类型的 x 值（类型 T）和参数的 Point 类型的 y 值（类型 W）来创建一个新 Point 类型的实例：
   
   #+BEGIN_SRC rust 
  struct Point<T, U> {
      x: T,
      y: U,
  }

  impl<T, U> Point<T, U> {
      fn mixup<V, W>(self, other: Point<V, W>) -> Point<T, W> {
          Point {
              x: self.x,
              y: other.y,
          }
      }
  }

  fn main() {
      let p1 = Point { x: 5, y: 10.4 };
      let p2 = Point { x: "Hello", y: 'c'};

      let p3 = p1.mixup(p2);

      println!("p3.x = {}, p3.y = {}", p3.x, p3.y);
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
     在 main 函数中，定义了一个有 i32 类型的 x（其值为 5）和 f64 的 y（其值为 10.4）的 p1，p2 则是一个有着字符串 slice 类型的 x（其值为 "Hello"）和 char 类型的 y（其值为c）的 Point
   
     在 p1 上以 p2 作为参数调用 mixup 会返回一个 p3，它会有一个 i32 类型的 x，因为 x 来自 p1，并拥有一个 char 类型的 y，因为 y 来自 p2，println! 会打印出 p3.x = 5, p3.y = c
   #+END_EXAMPLE
   
   这个例子的目的是展示一些泛型通过 impl 声明而另一些通过方法定义声明的情况：
   + 这里泛型参数 _T_ 和 _U_ 声明于 impl 之后，因为他们与 *结构体定义* 相对应
   + 泛型参数 _V_ 和 _W_ 声明于 _fn mixup_ 之后，因为他们只是相对于 *方法* 本身的
     
     
** 泛型代码的性能
   Rust 实现了泛型，使得使用泛型类型参数的代码相比使用具体类型并 *没有任何速度上的损失* ： 通过在 _编译时_ 进行 泛型代码的 *单态化* 来保证效率。这是一个通过填充编译时使用的具体类型，将通用代码转换为特定代码的过程
   
   #+BEGIN_EXAMPLE
   编译器所做的工作正好与创建泛型函数的步骤相反
   
   编译器寻找所有泛型代码被调用的位置并使用泛型代码针对具体类型生成代码
   #+END_EXAMPLE
   看看一个使用标准库中 Option 枚举的例子：
   #+BEGIN_SRC rust 
  let integer = Some(5);
  let float = Some(5.0);
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   当 Rust 编译这些代码的时候，它会进行单态化
   
   编译器会读取传递给 Option<T> 的值并发现有两种 Option<T>：一个对应 i32 另一个对应 f64
   
   为此，它会将泛型定义 Option<T> 展开为 Option_i32 和 Option_f64，接着将泛型定义替换为这两个具体的定义
   #+END_EXAMPLE
   
   编译器生成的单态化版本的代码看起来像这样，并包含将泛型 Option<T> 替换为编译器创建的具体定义后的用例代码：
   
   #+BEGIN_SRC rust 
  enum Option_i32 {
      Some(i32),
      None,
  }

  enum Option_f64 {
      Some(f64),
      None,
  }

  fn main() {
      let integer = Option_i32::Some(5);
      let float = Option_f64::Some(5.0);
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   可以使用泛型来编写不重复的代码，而 Rust 将会为每一个实例编译其特定类型的代码
   
   这意味着在使用泛型时没有运行时开销：当代码运行，它的执行效率就跟好像手写每个具体定义的重复代码一样
   
   这个单态化过程正是 Rust 泛型在运行时极其高效的原因
   #+END_EXAMPLE
   
* trait: 定义共享的行为
  trait 告诉 Rust 编译器 _某个特定类型_ *拥有* 可能 _与其他类型_ *共享* 的功能：
  + 通过 _trait_ 以一种抽象的方式定义共享的行为 
  + 使用 _trait bounds_ 指定泛型是任何拥有特定行为的类型
    
  #+BEGIN_EXAMPLE
    注意：trait 类似于其他语言中的常被称为接口的功能，虽然有一些不同
  #+END_EXAMPLE
  
** 定义 trait
   一个类型的行为由其可供调用的方法构成。如果可以对不同类型调用相同的方法的话，这些类型就可以共享相同的行为了。trait 定义是一种将 _方法签名_ *组合* 起来的方法，目的是定义一个 *实现* _某些目的_ 所 _必需的行为_ 的 *集合* 
   
   #+BEGIN_EXAMPLE
     例如，这里有多个存放了不同类型和属性文本的结构体：
   
     结构体 NewsArticle 用于存放发生于世界各地的新闻故事，而结构体 Tweet 最多只能存放 280 个字符的内容，以及像是否转推或是否是对推友的回复这样的元数据
   
     如果想要创建一个多媒体聚合库用来显示可能储存在 NewsArticle 或 Tweet 实例中的数据的总结：每一个结构体都需要的行为是他们是能够被总结的
   
     这样的话就可以调用实例的 summarize 方法来请求总结
   
   #+END_EXAMPLE
   下面展示了一个表现这个概念的 Summary trait 的定义：
   
   #+BEGIN_SRC rust 
  pub trait Summary {
      fn summarize(&self) -> String;
  }
   #+END_SRC
   
   + 这里使用 _trait_ 关键字来 *声明* ，后面是 _trait 的名字_ : 例子中是 Summary
   + 在 _大括号_ 中声明描述实现这个 trait 的类型所需要的行为的方法签名：在这个例子中是 fn summarize(&self) -> String
   + 在方法签名后跟分号，而不是在大括号中提供其实现
     
   #+BEGIN_EXAMPLE
     每一个实现这个 trait 的类型都需要提供其自定义行为的方法体
   
     编译器也会确保任何实现 Summary trait 的类型都拥有与这个签名的定义完全一致的 summarize 方法
   #+END_EXAMPLE
   trait 体中可以有多个方法：一行一个方法签名且都以分号结尾
   
