html/rust/generic.html

<div id="outline-container-orga74806a" class="outline-3">
<h3 id="orga74806a">方法定义中的泛型</h3>
<div class="outline-text-3" id="text-orga74806a">
<p>
可以为定义中 <b>带有泛型</b> 的 <span class="underline">结构体</span> 或 <span class="underline">枚举</span> <b>实现</b> <span class="underline">方法</span> 。下面展示了前面定义的结构体 Point&lt;T&gt;，和在其上实现的名为 x 的方法：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">T</span>,
    <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">T</span>,
}

<span style="color: #00bfff; font-weight: bold;">impl</span>&lt;<span style="color: #98f5ff;">T</span>&gt; <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">x</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; &amp;<span style="color: #98f5ff;">T</span> {
        &amp;<span style="color: #00bfff; font-weight: bold;">self</span>.x
    }
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">p</span> = <span style="color: #98f5ff;">Point</span> { <span style="color: #4eee94;">x</span>: 5, <span style="color: #4eee94;">y</span>: 10 };

    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"p.x = </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, p.x());
}
</pre>
</div>

<pre class="example">
   这里在 Point&lt;T&gt; 上定义了一个叫做 x 的方法来返回字段 x 中数据的引用
</pre>
<p>
注意：必须在 <span class="underline">impl 后面</span> 声明 T，这样就可以在 Point&lt;T&gt; 上实现的方法中使用它了
</p>

<pre class="example">
   在 impl 之后声明泛型 T ，这样 Rust 就知道 Point 的尖括号中的类型是泛型而不是具体类型
</pre>

<p>
当然也可以选择为 Point&lt;f32&gt; 实例实现方法，而不是为泛型 Point 实例。下面展示了一个没有在 impl 之后（的尖括号）声明泛型的例子，这里使用了一个具体类型 <span class="underline">f32</span> ：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">f32</span>&gt; {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">distance_from_origin</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">f32</span> {
        (<span style="color: #00bfff; font-weight: bold;">self</span>.x.powi(2) + <span style="color: #00bfff; font-weight: bold;">self</span>.y.powi(2)).sqrt()
    }
}
</pre>
</div>

<pre class="example">
   这段代码意味着 Point&lt;f32&gt; 类型会有一个方法 distance_from_origin，而其他 T 不是 f32 类型的 Point&lt;T&gt; 实例则没有定义此方法
   
   这个方法计算点实例与坐标 (0.0, 0.0) 之间的距离，并使用了只能用于浮点型的数学运算符
</pre>

<p>
<span class="underline">结构体定义</span> 中的泛型类型参数并 <b>不总是</b> 与 <span class="underline">结构体方法签名</span> 中使用的泛型是 <b>同一类型</b> 。下面实例中 Point&lt;T, U&gt; 上定义了一个方法 mixup。这个方法获取另一个 Point 作为参数，而它可能与调用 mixup 的 self 是不同的 Point 类型。这个方法用 self 的 Point 类型的 x 值（类型 T）和参数的 Point 类型的 y 值（类型 W）来创建一个新 Point 类型的实例：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">T</span>, <span style="color: #98f5ff;">U</span>&gt; {
    <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">T</span>,
    <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">U</span>,
}

<span style="color: #00bfff; font-weight: bold;">impl</span>&lt;<span style="color: #98f5ff;">T</span>, <span style="color: #98f5ff;">U</span>&gt; <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">T</span>, <span style="color: #98f5ff;">U</span>&gt; {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">mixup</span>&lt;<span style="color: #98f5ff;">V</span>, <span style="color: #98f5ff;">W</span>&gt;(<span style="color: #00bfff; font-weight: bold;">self</span>, <span style="color: #4eee94;">other</span>: <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">V</span>, <span style="color: #98f5ff;">W</span>&gt;) -&gt; <span style="color: #98f5ff;">Point</span>&lt;<span style="color: #98f5ff;">T</span>, <span style="color: #98f5ff;">W</span>&gt; {
        <span style="color: #98f5ff;">Point</span> {
            <span style="color: #4eee94;">x</span>: <span style="color: #00bfff; font-weight: bold;">self</span>.x,
            <span style="color: #4eee94;">y</span>: other.y,
        }
    }
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">p1</span> = <span style="color: #98f5ff;">Point</span> { <span style="color: #4eee94;">x</span>: 5, <span style="color: #4eee94;">y</span>: 10.4 };
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">p2</span> = <span style="color: #98f5ff;">Point</span> { <span style="color: #4eee94;">x</span>: <span style="color: #deb887;">"Hello"</span>, <span style="color: #4eee94;">y</span>: <span style="color: #deb887;">'c'</span>};

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">p3</span> = p1.mixup(p2);

    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"p3.x = </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">, p3.y = </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, p3.x, p3.y);
}
</pre>
</div>

<pre class="example">
     在 main 函数中，定义了一个有 i32 类型的 x（其值为 5）和 f64 的 y（其值为 10.4）的 p1，p2 则是一个有着字符串 slice 类型的 x（其值为 "Hello"）和 char 类型的 y（其值为c）的 Point
   
     在 p1 上以 p2 作为参数调用 mixup 会返回一个 p3，它会有一个 i32 类型的 x，因为 x 来自 p1，并拥有一个 char 类型的 y，因为 y 来自 p2，println! 会打印出 p3.x = 5, p3.y = c
</pre>

<p>
这个例子的目的是展示一些泛型通过 impl 声明而另一些通过方法定义声明的情况：
</p>
<ul class="org-ul">
<li>这里泛型参数 <span class="underline">T</span> 和 <span class="underline">U</span> 声明于 impl 之后，因为他们与 <b>结构体定义</b> 相对应</li>
<li>泛型参数 <span class="underline">V</span> 和 <span class="underline">W</span> 声明于 <span class="underline">fn mixup</span> 之后，因为他们只是相对于 <b>方法</b> 本身的</li>
</ul>
</div>
</div>


<div id="outline-container-org4df832d" class="outline-3">
<h3 id="org4df832d">泛型代码的性能</h3>
<div class="outline-text-3" id="text-org4df832d">
<p>
Rust 实现了泛型，使得使用泛型类型参数的代码相比使用具体类型并 <b>没有任何速度上的损失</b> ： 通过在 <span class="underline">编译时</span> 进行 泛型代码的 <b>单态化</b> 来保证效率。这是一个通过填充编译时使用的具体类型，将通用代码转换为特定代码的过程
</p>

<pre class="example">
   编译器所做的工作正好与创建泛型函数的步骤相反
   
   编译器寻找所有泛型代码被调用的位置并使用泛型代码针对具体类型生成代码
</pre>
<p>
看看一个使用标准库中 Option 枚举的例子：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">integer</span> = <span style="color: #98f5ff;">Some</span>(5);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">float</span> = <span style="color: #98f5ff;">Some</span>(5.0);
</pre>
</div>

<pre class="example">
   当 Rust 编译这些代码的时候，它会进行单态化
   
   编译器会读取传递给 Option&lt;T&gt; 的值并发现有两种 Option&lt;T&gt;：一个对应 i32 另一个对应 f64
   
   为此，它会将泛型定义 Option&lt;T&gt; 展开为 Option_i32 和 Option_f64，接着将泛型定义替换为这两个具体的定义
</pre>

<p>
编译器生成的单态化版本的代码看起来像这样，并包含将泛型 Option&lt;T&gt; 替换为编译器创建的具体定义后的用例代码：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Option_i32</span> {
    <span style="color: #98f5ff;">Some</span>(<span style="color: #98f5ff;">i32</span>),
    <span style="color: #98f5ff;">None</span>,
}

<span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Option_f64</span> {
    <span style="color: #98f5ff;">Some</span>(<span style="color: #98f5ff;">f64</span>),
    <span style="color: #98f5ff;">None</span>,
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">integer</span> = <span style="color: #98f5ff;">Option_i32</span>::<span style="color: #98f5ff;">Some</span>(5);
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">float</span> = <span style="color: #98f5ff;">Option_f64</span>::<span style="color: #98f5ff;">Some</span>(5.0);
}
</pre>
</div>

<pre class="example">
   可以使用泛型来编写不重复的代码，而 Rust 将会为每一个实例编译其特定类型的代码
   
   这意味着在使用泛型时没有运行时开销：当代码运行，它的执行效率就跟好像手写每个具体定义的重复代码一样
   
   这个单态化过程正是 Rust 泛型在运行时极其高效的原因
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf54a27" class="outline-2">
<h2 id="orgbf54a27">trait: 定义共享的行为</h2>
<div class="outline-text-2" id="text-orgbf54a27">
<p>
trait 告诉 Rust 编译器 <span class="underline">某个特定类型</span> <b>拥有</b> 可能 <span class="underline">与其他类型</span> <b>共享</b> 的功能：
</p>
<ul class="org-ul">
<li>通过 <span class="underline">trait</span> 以一种抽象的方式定义共享的行为</li>
<li>使用 <span class="underline">trait bounds</span> 指定泛型是任何拥有特定行为的类型</li>
</ul>

<pre class="example">
    注意：trait 类似于其他语言中的常被称为接口的功能，虽然有一些不同
</pre>
</div>

<div id="outline-container-orgbed4ed0" class="outline-3">
<h3 id="orgbed4ed0">定义 trait</h3>
<div class="outline-text-3" id="text-orgbed4ed0">
<p>
一个类型的行为由其可供调用的方法构成。如果可以对不同类型调用相同的方法的话，这些类型就可以共享相同的行为了。trait 定义是一种将 <span class="underline">方法签名</span> <b>组合</b> 起来的方法，目的是定义一个 <b>实现</b> <span class="underline">某些目的</span> 所 <span class="underline">必需的行为</span> 的 <b>集合</b> 
</p>

<pre class="example">
     例如，这里有多个存放了不同类型和属性文本的结构体：
   
     结构体 NewsArticle 用于存放发生于世界各地的新闻故事，而结构体 Tweet 最多只能存放 280 个字符的内容，以及像是否转推或是否是对推友的回复这样的元数据
   
     如果想要创建一个多媒体聚合库用来显示可能储存在 NewsArticle 或 Tweet 实例中的数据的总结：每一个结构体都需要的行为是他们是能够被总结的
   
     这样的话就可以调用实例的 summarize 方法来请求总结
   
</pre>
<p>
下面展示了一个表现这个概念的 Summary trait 的定义：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">trait</span> <span style="color: #98f5ff;">Summary</span> {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">summarize</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">String</span>;
}
</pre>
</div>

<ul class="org-ul">
<li>这里使用 <span class="underline">trait</span> 关键字来 <b>声明</b> ，后面是 <span class="underline">trait 的名字</span> : 例子中是 Summary</li>
<li>在 <span class="underline">大括号</span> 中声明描述实现这个 trait 的类型所需要的行为的方法签名：在这个例子中是 fn summarize(&amp;self) -&gt; String</li>
<li>在方法签名后跟分号，而不是在大括号中提供其实现</li>
</ul>

<pre class="example">
     每一个实现这个 trait 的类型都需要提供其自定义行为的方法体
   
     编译器也会确保任何实现 Summary trait 的类型都拥有与这个签名的定义完全一致的 summarize 方法
</pre>
<p>
trait 体中可以有多个方法：一行一个方法签名且都以分号结尾
</p>
</div>
</div>
