src/rust/generic.org
** 为类型实现 trait
   现在已经定义了 Summary trait，接着就可以在多媒体聚合库中需要拥有这个行为的类型上 _实现_ 它了。下面示例中展示了：
   + NewsArticle 结构体上 Summary trait 的一个实现，它使用标题、作者和创建的位置作为 summarize 的返回值
   + 对于 Tweet 结构体，选择将 summarize 定义为用户名后跟推文的全部文本作为返回值，并假设推文内容已经被限制为 280 字符以内
     
   #+BEGIN_SRC rust 
  pub struct NewsArticle {
      pub headline: String,
      pub location: String,
      pub author: String,
      pub content: String,
  }

  impl Summary for NewsArticle {
      fn summarize(&self) -> String {
	  format!("{}, by {} ({})", self.headline, self.author, self.location)
      }
  }

  pub struct Tweet {
      pub username: String,
      pub content: String,
      pub reply: bool,
      pub retweet: bool,
  }

  impl Summary for Tweet {
      fn summarize(&self) -> String {
	  format!("{}: {}", self.username, self.content)
      }
  }
   #+END_SRC
   
   在类型上实现 trait 类似于实现与 trait 无关的方法。区别在于 _impl 关键字_ 之后，提供需要 _实现 trait 的名称_ ，接着是 _for_ 和需要实现 trait 的 _类型的名称_ 
   
   #+BEGIN_EXAMPLE
     在 impl 块中，使用 trait 定义中的方法签名，不过不再后跟分号，而是需要在大括号中编写函数体来为特定类型实现 trait 方法所拥有的行为
   #+END_EXAMPLE
   
   一旦实现了 trait，就可以用与 NewsArticle 和 Tweet 实例的非 trait 方法一样的方式调用 trait 方法了：
   
   #+BEGIN_SRC rust 
  let tweet = Tweet {
      username: String::from("horse_ebooks"),
      content: String::from("of course, as you probably already know, people"),
      reply: false,
      retweet: false,
  };

  println!("1 new tweet: {}", tweet.summarize());
   #+END_SRC
   
   这会打印出：
   #+BEGIN_SRC sh 
1 new tweet: horse_ebooks: of course, as you probably already know, people
   #+END_SRC
   
   #+BEGIN_EXAMPLE
     注意：因为在相同的 lib.rs 里定义了 Summary trait 和 NewsArticle 与 Tweet 类型，所以他们是位于同一作用域的
   
     如果这个 lib.rs 是对应 aggregator crate 的，而别人想要利用我们 crate 的功能为其自己的库作用域中的结构体实现 Summary trait
   
     首先他们需要将 trait 引入作用域。这可以通过指定 use aggregator::Summary; 实现，这样就可以为其类型实现 Summary trait 了
   
     Summary 还必须是公有 trait 使得其他 crate 可以实现它，这也是为什么中将 pub 置于 trait 之前
   #+END_EXAMPLE
   
   实现 trait 时需要注意的一个限制：只有当 _trait_ 或者要实现 _trait 的类型_ 位于 _crate 的本地作用域_ 时，才能为该类型实现 trait
   #+BEGIN_EXAMPLE
     例如，可以为 aggregator crate 的自定义类型 Tweet 实现如标准库中的 Display trait，这是因为 Tweet 类型位于 aggregator crate 本地的作用域中
   
     类似地，也可以在 aggregator crate 中为 Vec<T> 实现 Summary，这是因为 Summary trait 位于 aggregator crate 本地作用域中
   #+END_EXAMPLE
   但是 *不能* 为 _外部类型_ 实现 _外部 trait_ 
   #+BEGIN_EXAMPLE
     例如，不能在 aggregator crate 中为 Vec<T> 实现 Display trait
   
     这是因为 Display 和 Vec<T> 都定义于标准库中，它们并不位于 aggregator crate 本地作用域中
   #+END_EXAMPLE 
   
   这个限制是被称为 _相干性_ 的程序属性的一部分，或者更具体的说是 _孤儿规则_ ，其得名于不存在父类型
   #+BEGIN_EXAMPLE
     这条规则确保了其他人编写的代码不会破坏你代码，反之亦然
   
     没有这条规则的话，两个 crate 可以分别对相同类型实现相同的 trait，而 Rust 将无从得知应该使用哪一个实现
   #+END_EXAMPLE
   
