html/rust/generic.html

<div id="outline-container-orgc669d9f" class="outline-3">
<h3 id="orgc669d9f">为类型实现 trait</h3>
<div class="outline-text-3" id="text-orgc669d9f">
<p>
现在已经定义了 Summary trait，接着就可以在多媒体聚合库中需要拥有这个行为的类型上 <span class="underline">实现</span> 它了。下面示例中展示了：
</p>
<ul class="org-ul">
<li>NewsArticle 结构体上 Summary trait 的一个实现，它使用标题、作者和创建的位置作为 summarize 的返回值</li>
<li>对于 Tweet 结构体，选择将 summarize 定义为用户名后跟推文的全部文本作为返回值，并假设推文内容已经被限制为 280 字符以内</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">NewsArticle</span> {
    <span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #4eee94;">headline</span>: <span style="color: #98f5ff;">String</span>,
    <span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #4eee94;">location</span>: <span style="color: #98f5ff;">String</span>,
    <span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #4eee94;">author</span>: <span style="color: #98f5ff;">String</span>,
    <span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #4eee94;">content</span>: <span style="color: #98f5ff;">String</span>,
}

<span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span> <span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #98f5ff;">NewsArticle</span> {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">summarize</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">String</span> {
        <span style="color: #f08080;">format!</span>(<span style="color: #deb887;">"</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">, by </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> (</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">)"</span>, <span style="color: #00bfff; font-weight: bold;">self</span>.headline, <span style="color: #00bfff; font-weight: bold;">self</span>.author, <span style="color: #00bfff; font-weight: bold;">self</span>.location)
    }
}

<span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Tweet</span> {
    <span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #4eee94;">username</span>: <span style="color: #98f5ff;">String</span>,
    <span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #4eee94;">content</span>: <span style="color: #98f5ff;">String</span>,
    <span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #4eee94;">reply</span>: <span style="color: #98f5ff;">bool</span>,
    <span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #4eee94;">retweet</span>: <span style="color: #98f5ff;">bool</span>,
}

<span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span> <span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #98f5ff;">Tweet</span> {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">summarize</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">String</span> {
        <span style="color: #f08080;">format!</span>(<span style="color: #deb887;">"</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">: </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, <span style="color: #00bfff; font-weight: bold;">self</span>.username, <span style="color: #00bfff; font-weight: bold;">self</span>.content)
    }
}
</pre>
</div>

<p>
在类型上实现 trait 类似于实现与 trait 无关的方法。区别在于 <span class="underline">impl 关键字</span> 之后，提供需要 <span class="underline">实现 trait 的名称</span> ，接着是 <span class="underline">for</span> 和需要实现 trait 的 <span class="underline">类型的名称</span> 
</p>

<pre class="example">
     在 impl 块中，使用 trait 定义中的方法签名，不过不再后跟分号，而是需要在大括号中编写函数体来为特定类型实现 trait 方法所拥有的行为
</pre>

<p>
一旦实现了 trait，就可以用与 NewsArticle 和 Tweet 实例的非 trait 方法一样的方式调用 trait 方法了：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">tweet</span> = <span style="color: #98f5ff;">Tweet</span> {
    <span style="color: #4eee94;">username</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"horse_ebooks"</span>),
    <span style="color: #4eee94;">content</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"of course, as you probably already know, people"</span>),
    <span style="color: #4eee94;">reply</span>: <span style="color: #00bfff; font-weight: bold;">false</span>,
    <span style="color: #4eee94;">retweet</span>: <span style="color: #00bfff; font-weight: bold;">false</span>,
};

<span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"1 new tweet: </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, tweet.summarize());
</pre>
</div>

<p>
这会打印出：
</p>
<div class="org-src-container">
<pre class="src src-sh">1 new tweet: horse_ebooks: of course, as you probably already know, people
</pre>
</div>

<pre class="example">
注意：因为在相同的 lib.rs 里定义了 Summary trait 和 NewsArticle 与 Tweet 类型，所以他们是位于同一作用域的

如果这个 lib.rs 是对应 aggregator crate 的，而别人想要利用我们 crate 的功能为其自己的库作用域中的结构体实现 Summary trait

首先他们需要将 trait 引入作用域。这可以通过指定 use aggregator::Summary; 实现，这样就可以为其类型实现 Summary trait 了

Summary 还必须是公有 trait 使得其他 crate 可以实现它，这也是为什么中将 pub 置于 trait 之前
</pre>

<p>
实现 trait 时需要注意的一个限制：只有当 <span class="underline">trait</span> 或者要实现 <span class="underline">trait 的类型</span> 位于 <span class="underline">crate 的本地作用域</span> 时，才能为该类型实现 trait
</p>
<pre class="example">
     例如，可以为 aggregator crate 的自定义类型 Tweet 实现如标准库中的 Display trait，这是因为 Tweet 类型位于 aggregator crate 本地的作用域中
   
     类似地，也可以在 aggregator crate 中为 Vec&lt;T&gt; 实现 Summary，这是因为 Summary trait 位于 aggregator crate 本地作用域中
</pre>
<p>
但是 <b>不能</b> 为 <span class="underline">外部类型</span> 实现 <span class="underline">外部 trait</span> 
</p>
<pre class="example">
     例如，不能在 aggregator crate 中为 Vec&lt;T&gt; 实现 Display trait
   
     这是因为 Display 和 Vec&lt;T&gt; 都定义于标准库中，它们并不位于 aggregator crate 本地作用域中
</pre>

<p>
这个限制是被称为 <span class="underline">相干性</span> 的程序属性的一部分，或者更具体的说是 <span class="underline">孤儿规则</span> ，其得名于不存在父类型
</p>
<pre class="example">
     这条规则确保了其他人编写的代码不会破坏你代码，反之亦然
   
     没有这条规则的话，两个 crate 可以分别对相同类型实现相同的 trait，而 Rust 将无从得知应该使用哪一个实现
</pre>
</div>
