src/rust/generic.org
*** 默认实现
    可以为 trait 中的某些或全部方法提供 _默认的行为_ ，而不是在每个类型的每个实现中都定义自己的行为是很有用的
    
    #+BEGIN_EXAMPLE
    这样当为某个特定类型实现 trait 时，可以选择保留或重载每个方法的默认行为
    #+END_EXAMPLE
    
    下面展示了如何为 Summary trait 的 summarize 方法指定一个默认的字符串值，而不是只是定义方法签名：
    
    #+BEGIN_SRC rust 
  pub trait Summary {
      fn summarize(&self) -> String {
	  String::from("(Read more...)")
      }
  }
    #+END_SRC
    
    如果想要对 NewsArticle 实例使用这个默认实现，而不是定义一个自己的实现，则可以通过 _impl Summary for NewsArticle {}_ 指定一个 _空的 impl 块_ 
    
    #+BEGIN_SRC rust 
  impl Summary for NewsArticle {
  }
    #+END_SRC
    
    因为提供了一个默认实现并且指定 NewsArticle 实现 Summary trait。因此仍然可以对 NewsArticle 实例调用 summarize 方法，如下所示：
    
    #+BEGIN_SRC rust 
  let article = NewsArticle {
      headline: String::from("Penguins win the Stanley Cup Championship!"),
      location: String::from("Pittsburgh, PA, USA"),
      author: String::from("Iceburgh"),
      content: String::from("The Pittsburgh Penguins once again are the best
      hockey team in the NHL."),
  };

  println!("New article available! {}", article.summarize());
    #+END_SRC
    
    这段代码会打印：
    #+BEGIN_SRC sh 
New article available! (Read more...)。
    #+END_SRC
    
    #+BEGIN_EXAMPLE
      为 summarize 创建默认实现并不要求对 Tweet 上的 Summary 实现做任何改变
    
      其原因是重载一个默认实现的语法与实现没有默认实现的 trait 方法的语法一样
    #+END_EXAMPLE
    
    默认实现允许调用相同 trait 中的其他方法，哪怕这些方法没有默认实现。如此，trait 可以提供很多有用的功能而只需要实现指定一小部分内容。例如，可以定义 Summary trait，使其具有一个需要实现的 summarize_author 方法，然后定义一个 summarize 方法，此方法的默认实现调用 summarize_author 方法：
    
    #+BEGIN_SRC rust 
  pub trait Summary {
      fn summarize_author(&self) -> String;

      fn summarize(&self) -> String {
	  format!("(Read more from {}...)", self.summarize_author())
      }
  }
    #+END_SRC 
    
    为了使用这个版本的 Summary，只需在实现 trait 时定义 summarize_author 即可：
    #+BEGIN_SRC rust 
  impl Summary for Tweet {
      fn summarize_author(&self) -> String {
	  format!("@{}", self.username)
      }
  }
    #+END_SRC
    
    一旦定义了 summarize_author，就可以对 Tweet 结构体的实例调用 summarize 了，而 summary 的默认实现会调用提供的 summarize_author 定义。因为实现了 summarize_author，Summary trait 就提供了 summarize 方法的功能，且无需编写更多的代码：
    
    #+BEGIN_SRC rust 
  let tweet = Tweet {
      username: String::from("horse_ebooks"),
      content: String::from("of course, as you probably already know, people"),
      reply: false,
      retweet: false,
  };

  println!("1 new tweet: {}", tweet.summarize());
    #+END_SRC
    
    这会打印出：
    #+BEGIN_SRC sh 
1 new tweet: (Read more from @horse_ebooks...)
    #+END_SRC
    
    注意：无法从 _相同方法的重载_ 实现中调用 _默认_ 方法 
    
** trait 作为参数
   知道了如何定义 trait 和在类型上实现这些 trait 之后，可以探索一下如何使用 trait 来接受 *多种不同类型的参数* 
   
   例如：在前面为 NewsArticle 和 Tweet 类型实现了 Summary trait。可以定义一个函数 notify 来调用其参数 item 上的 summarize 方法，该参数是实现了 Summary trait 的某种类型。为此可以使用 impl Trait 语法，像这样：
   
   #+BEGIN_SRC rust 
  pub fn notify(item: impl Summary) {
      println!("Breaking news! {}", item.summarize());
  }
   #+END_SRC
   
   对于 item 参数，指定了 _impl 关键字_ 和 _trait 名称_ ，而不是具体的类型，该参数支持任何实现了指定 trait 的类型
   
   #+BEGIN_EXAMPLE
     在 notify 函数体中，可以调用任何来自 Summary trait 的方法，比如 summarize
   
     可以传递任何 NewsArticle 或 Tweet 的实例来调用 notify
   
     任何用其它如 String 或 i32 的类型调用该函数的代码都不能编译，因为它们没有实现 Summary
   #+END_EXAMPLE
   
*** Trait Bound 语法 
    impl Trait 语法实际上是一个语法糖。真正的语法被称为 _trait bound_ ，这看起来像： 
    
    #+BEGIN_SRC rust 
  pub fn notify<T: Summary>(item: T) {
      println!("Breaking news! {}", item.summarize());
  }
    #+END_SRC 
    
    这与之前的例子相同，不过稍微冗长了一些。trait bound 与泛型参数声明在一起，位于 _尖括号中的冒号_ 后面
    
    #+BEGIN_EXAMPLE
      impl Trait 很方便，适用于短小的例子
    
      而 trait bound 则适用于更复杂的场景
    #+END_EXAMPLE
    
    例如，可以获取两个实现了 Summary 的参数。使用 impl Trait 的语法看起来像这样：
    
    #+BEGIN_SRC rust 
  pub fn notify(item1: impl Summary, item2: impl Summary) {
    #+END_SRC
    
    这适用于 item1 和 item2 允许是不同类型的情况（只要它们都实现了 Summary）。不过如果你希望强制它们都是相同类型呢？这只有在使用 trait bound 时才有可能：
    
    #+BEGIN_SRC rust 
  pub fn notify<T: Summary>(item1: T, item2: T) {
    #+END_SRC
    
    泛型 _T_ 被指定为 item1 和 item2 的参数限制，如此传递给参数 item1 和 item2 值的具体类型必须一致 
    
