html/rust/generic.html

<div id="outline-container-orgaa794f0" class="outline-4">
<h4 id="orgaa794f0">默认实现</h4>
<div class="outline-text-4" id="text-orgaa794f0">
<p>
可以为 trait 中的某些或全部方法提供 <span class="underline">默认的行为</span> ，而不是在每个类型的每个实现中都定义自己的行为是很有用的
</p>

<pre class="example">
    这样当为某个特定类型实现 trait 时，可以选择保留或重载每个方法的默认行为
</pre>

<p>
下面展示了如何为 Summary trait 的 summarize 方法指定一个默认的字符串值，而不是只是定义方法签名：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">trait</span> <span style="color: #98f5ff;">Summary</span> {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">summarize</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">String</span> {
        <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"(Read more...)"</span>)
    }
}
</pre>
</div>

<p>
如果想要对 NewsArticle 实例使用这个默认实现，而不是定义一个自己的实现，则可以通过 <span class="underline">impl Summary for NewsArticle {}</span> 指定一个 <span class="underline">空的 impl 块</span> 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span> <span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #98f5ff;">NewsArticle</span> {
}
</pre>
</div>

<p>
因为提供了一个默认实现并且指定 NewsArticle 实现 Summary trait。因此仍然可以对 NewsArticle 实例调用 summarize 方法，如下所示：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">article</span> = <span style="color: #98f5ff;">NewsArticle</span> {
    <span style="color: #4eee94;">headline</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Penguins win the Stanley Cup Championship!"</span>),
    <span style="color: #4eee94;">location</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Pittsburgh, PA, USA"</span>),
    <span style="color: #4eee94;">author</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Iceburgh"</span>),
    <span style="color: #4eee94;">content</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"The Pittsburgh Penguins once again are the best</span>
<span style="color: #deb887;">    hockey team in the NHL."</span>),
};

<span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"New article available! </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, article.summarize());
</pre>
</div>

<p>
这段代码会打印：
</p>
<div class="org-src-container">
<pre class="src src-sh">New article available! (Read more...)&#12290;
</pre>
</div>

<pre class="example">
      为 summarize 创建默认实现并不要求对 Tweet 上的 Summary 实现做任何改变
    
      其原因是重载一个默认实现的语法与实现没有默认实现的 trait 方法的语法一样
</pre>

<p>
默认实现允许调用相同 trait 中的其他方法，哪怕这些方法没有默认实现。如此，trait 可以提供很多有用的功能而只需要实现指定一小部分内容。例如，可以定义 Summary trait，使其具有一个需要实现的 summarize_author 方法，然后定义一个 summarize 方法，此方法的默认实现调用 summarize_author 方法：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">trait</span> <span style="color: #98f5ff;">Summary</span> {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">summarize_author</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">String</span>;

    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">summarize</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">String</span> {
        <span style="color: #f08080;">format!</span>(<span style="color: #deb887;">"(Read more from </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">...)"</span>, <span style="color: #00bfff; font-weight: bold;">self</span>.summarize_author())
    }
}
</pre>
</div>

<p>
为了使用这个版本的 Summary，只需在实现 trait 时定义 summarize_author 即可：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span> <span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #98f5ff;">Tweet</span> {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">summarize_author</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">String</span> {
        <span style="color: #f08080;">format!</span>(<span style="color: #deb887;">"@</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, <span style="color: #00bfff; font-weight: bold;">self</span>.username)
    }
}
</pre>
</div>

<p>
一旦定义了 summarize_author，就可以对 Tweet 结构体的实例调用 summarize 了，而 summary 的默认实现会调用提供的 summarize_author 定义。因为实现了 summarize_author，Summary trait 就提供了 summarize 方法的功能，且无需编写更多的代码：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">tweet</span> = <span style="color: #98f5ff;">Tweet</span> {
    <span style="color: #4eee94;">username</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"horse_ebooks"</span>),
    <span style="color: #4eee94;">content</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"of course, as you probably already know, people"</span>),
    <span style="color: #4eee94;">reply</span>: <span style="color: #00bfff; font-weight: bold;">false</span>,
    <span style="color: #4eee94;">retweet</span>: <span style="color: #00bfff; font-weight: bold;">false</span>,
};

<span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"1 new tweet: </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, tweet.summarize());
</pre>
</div>

<p>
这会打印出：
</p>
<div class="org-src-container">
<pre class="src src-sh">1 new tweet: (Read more from @horse_ebooks...)
</pre>
</div>

<p>
注意：无法从 <span class="underline">相同方法的重载</span> 实现中调用 <span class="underline">默认</span> 方法 
</p>
</div>
</div>
</div>

<div id="outline-container-orga262903" class="outline-3">
<h3 id="orga262903">trait 作为参数</h3>
<div class="outline-text-3" id="text-orga262903">
<p>
知道了如何定义 trait 和在类型上实现这些 trait 之后，可以探索一下如何使用 trait 来接受 <b>多种不同类型的参数</b> 
</p>

<p>
例如：在前面为 NewsArticle 和 Tweet 类型实现了 Summary trait。可以定义一个函数 notify 来调用其参数 item 上的 summarize 方法，该参数是实现了 Summary trait 的某种类型。为此可以使用 impl Trait 语法，像这样：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">notify</span>(<span style="color: #4eee94;">item</span>: <span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span>) {
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"Breaking news! </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, item.summarize());
}
</pre>
</div>

<p>
对于 item 参数，指定了 <span class="underline">impl 关键字</span> 和 <span class="underline">trait 名称</span> ，而不是具体的类型，该参数支持任何实现了指定 trait 的类型
</p>

<pre class="example">
     在 notify 函数体中，可以调用任何来自 Summary trait 的方法，比如 summarize
   
     可以传递任何 NewsArticle 或 Tweet 的实例来调用 notify
   
     任何用其它如 String 或 i32 的类型调用该函数的代码都不能编译，因为它们没有实现 Summary
</pre>
</div>

<div id="outline-container-org819223e" class="outline-4">
<h4 id="org819223e">Trait Bound 语法</h4>
<div class="outline-text-4" id="text-org819223e">
<p>
impl Trait 语法实际上是一个语法糖。真正的语法被称为 <span class="underline">trait bound</span> ，这看起来像： 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">notify</span>&lt;<span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">Summary</span>&gt;(<span style="color: #4eee94;">item</span>: <span style="color: #98f5ff;">T</span>) {
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"Breaking news! </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, item.summarize());
}
</pre>
</div>

<p>
这与之前的例子相同，不过稍微冗长了一些。trait bound 与泛型参数声明在一起，位于 <span class="underline">尖括号中的冒号</span> 后面
</p>

<pre class="example">
impl Trait 很方便，适用于短小的例子

而 trait bound 则适用于更复杂的场景
</pre>

<p>
例如，可以获取两个实现了 Summary 的参数。使用 impl Trait 的语法看起来像这样：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">notify</span>(<span style="color: #4eee94;">item1</span>: <span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span>, <span style="color: #4eee94;">item2</span>: <span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span>) {
</pre>
</div>

<p>
这适用于 item1 和 item2 允许是不同类型的情况（只要它们都实现了 Summary）。不过如果你希望强制它们都是相同类型呢？这只有在使用 trait bound 时才有可能：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">notify</span>&lt;<span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">Summary</span>&gt;(<span style="color: #4eee94;">item1</span>: <span style="color: #98f5ff;">T</span>, <span style="color: #4eee94;">item2</span>: <span style="color: #98f5ff;">T</span>) {
</pre>
</div>

<p>
泛型 <span class="underline">T</span> 被指定为 item1 和 item2 的参数限制，如此传递给参数 item1 和 item2 值的具体类型必须一致 
</p>
</div>
