src/rust/generic.org
**** 通过 + 指定多个 trait bound
     如果 notify 需要显示 item 的格式化形式，同时也要使用 summarize 方法，那么 item 就需要同时实现两个不同的 trait：Display 和 Summary。这可以通过 _+ 语法_ 实现：
     
     #+BEGIN_SRC rust 
  pub fn notify(item: impl Summary + Display) {
     #+END_SRC
     
     _+ 语法_ 也适用于泛型的 trait bound：
     #+BEGIN_SRC rust 
  pub fn notify<T: Summary + Display>(item: T) {
     #+END_SRC
     
     #+BEGIN_EXAMPLE
       通过指定这两个 trait bound，notify 的函数体可以调用 summarize 并使用 {} 来格式化 item
     #+END_EXAMPLE
     
**** 通过 where 简化 trait bound
     #+BEGIN_SRC rust 
  fn some_function<T: Display + Clone, U: Clone + Debug>(t: T, u: U) -> i32 {
     #+END_SRC
     
     #+BEGIN_EXAMPLE
       然而，使用过多的 trait bound 也有缺点
     
       每个泛型有其自己的 trait bound，所以有多个泛型参数的函数在名称和参数列表之间会有很长的 trait bound 信息，这使得函数签名难以阅读
     #+END_EXAMPLE
     
     为此，Rust 有另一个在函数签名之后的 _where 从句_ 中指定 trait bound 的语法。可以这么写：
     
     #+BEGIN_SRC rust 
  fn some_function<T, U>(t: T, u: U) -> i32
      where T: Display + Clone,
	    U: Clone + Debug
  {
     #+END_SRC
     
     #+BEGIN_EXAMPLE
       这个函数签名就显得不那么杂乱，函数名、参数列表和返回值类型都离得很近，看起来类似没有很多 trait bounds 的函数
     #+END_EXAMPLE
     
** 返回实现了 trait 的类型
   也可以在返回值中使用 impl Trait 语法，来返回实现了某个 trait 的类型：
   #+BEGIN_SRC rust 
  fn returns_summarizable() -> impl Summary {
      Tweet {
	  username: String::from("horse_ebooks"),
	  content: String::from("of course, as you probably already know, people"),
	  reply: false,
	  retweet: false,
      }
  }
   #+END_SRC
   
   通过使用 impl Summary 作为返回值类型，指定了 returns_summarizable 函数返回某个实现了 Summary trait 的类型，但是不确定其具体的类型。在这个例子中 returns_summarizable 返回了一个 Tweet，不过调用方并不知情
   
   #+BEGIN_EXAMPLE
     返回一个只是指定了需要实现的 trait 的类型的能力在闭包和迭代器场景十分的有用
   
     闭包和迭代器创建只有编译器知道的类型，或者是非常非常长的类型
   
     impl Trait 允许简单的指定函数返回一个 Iterator 而无需写出实际的冗长的类型
   #+END_EXAMPLE
   
   不过这只适用于返回 _单一类型_ 的情况。例如，这段代码的返回值类型指定为返回 impl Summary，但是返回了 NewsArticle 或 Tweet 就行不通：
   
   #+BEGIN_SRC rust 
  fn returns_summarizable(switch: bool) -> impl Summary {
      if switch {
	  NewsArticle {
	      headline: String::from("Penguins win the Stanley Cup Championship!"),
	      location: String::from("Pittsburgh, PA, USA"),
	      author: String::from("Iceburgh"),
	      content: String::from("The Pittsburgh Penguins once again are the best
	      hockey team in the NHL."),
	  }
      } else {
	  Tweet {
	      username: String::from("horse_ebooks"),
	      content: String::from("of course, as you probably already know, people"),
	      reply: false,
	      retweet: false,
	  }
      }
  }
   #+END_SRC
   
   编译会报如下的错误：
   #+BEGIN_SRC sh 
  error[E0308]: if and else have incompatible types
    --> src/main.rs:88:9
     |
  79 |   /     if switch {
  80 |   |         NewsArticle {
     |  _|_________-
  81 | | |             headline: String::from("Penguins win the Stanley Cup Championship!"),
  82 | | |             location: String::from("Pittsburgh, PA, USA"),
  83 | | |             author: String::from("Iceburgh"),
  84 | | |             content: String::from("The Pittsburgh Penguins once again are the best
  85 | | |             hockey team in the NHL."),
  86 | | |         }
     | |_|_________- expected because of this
  87 |   |     } else {
  88 | / |         Tweet {
  89 | | |             username: String::from("horse_ebooks"),
  90 | | |             content: String::from("of course, as you probably already know, people"),
  91 | | |             reply: false,
  92 | | |             retweet: false,
  93 | | |         }
     | |_|_________^ expected struct `NewsArticle`, found struct `Tweet`
  94 |   |     }
     |   |_____- if and else have incompatible types
     |
     = note: expected type `NewsArticle`
		found type `Tweet`
   #+END_SRC
   
