html/rust/generic.html

<div id="outline-container-orgf3972bb" class="outline-5">
<h5 id="orgf3972bb">通过 + 指定多个 trait bound</h5>
<div class="outline-text-5" id="text-orgf3972bb">
<p>
如果 notify 需要显示 item 的格式化形式，同时也要使用 summarize 方法，那么 item 就需要同时实现两个不同的 trait：Display 和 Summary。这可以通过 <span class="underline">+ 语法</span> 实现：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">notify</span>(<span style="color: #4eee94;">item</span>: <span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span> + <span style="color: #98f5ff;">Display</span>) {
</pre>
</div>

<p>
<span class="underline">+ 语法</span> 也适用于泛型的 trait bound：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">notify</span>&lt;<span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">Summary</span> + <span style="color: #98f5ff;">Display</span>&gt;(<span style="color: #4eee94;">item</span>: <span style="color: #98f5ff;">T</span>) {
</pre>
</div>

<pre class="example">
       通过指定这两个 trait bound，notify 的函数体可以调用 summarize 并使用 {} 来格式化 item
</pre>
</div>
</div>

<div id="outline-container-orgbe13876" class="outline-5">
<h5 id="orgbe13876">通过 where 简化 trait bound</h5>
<div class="outline-text-5" id="text-orgbe13876">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">some_function</span>&lt;<span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">Display</span> + <span style="color: #98f5ff;">Clone</span>, <span style="color: #4eee94;">U</span>: <span style="color: #98f5ff;">Clone</span> + <span style="color: #98f5ff;">Debug</span>&gt;(<span style="color: #4eee94;">t</span>: <span style="color: #98f5ff;">T</span>, <span style="color: #4eee94;">u</span>: <span style="color: #98f5ff;">U</span>) -&gt; <span style="color: #98f5ff;">i32</span> {
</pre>
</div>

<pre class="example">
       然而，使用过多的 trait bound 也有缺点
     
       每个泛型有其自己的 trait bound，所以有多个泛型参数的函数在名称和参数列表之间会有很长的 trait bound 信息，这使得函数签名难以阅读
</pre>

<p>
为此，Rust 有另一个在函数签名之后的 <span class="underline">where 从句</span> 中指定 trait bound 的语法。可以这么写：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">some_function</span>&lt;<span style="color: #98f5ff;">T</span>, <span style="color: #98f5ff;">U</span>&gt;(<span style="color: #4eee94;">t</span>: <span style="color: #98f5ff;">T</span>, <span style="color: #4eee94;">u</span>: <span style="color: #98f5ff;">U</span>) -&gt; <span style="color: #98f5ff;">i32</span>
    <span style="color: #00bfff; font-weight: bold;">where</span> <span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">Display</span> + <span style="color: #98f5ff;">Clone</span>,
          <span style="color: #4eee94;">U</span>: <span style="color: #98f5ff;">Clone</span> + <span style="color: #98f5ff;">Debug</span>
{
</pre>
</div>

<pre class="example">
       这个函数签名就显得不那么杂乱，函数名、参数列表和返回值类型都离得很近，看起来类似没有很多 trait bounds 的函数
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org43e6911" class="outline-3">
<h3 id="org43e6911">返回实现了 trait 的类型</h3>
<div class="outline-text-3" id="text-org43e6911">
<p>
也可以在返回值中使用 impl Trait 语法，来返回实现了某个 trait 的类型：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">returns_summarizable</span>() -&gt; <span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span> {
    <span style="color: #98f5ff;">Tweet</span> {
        <span style="color: #4eee94;">username</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"horse_ebooks"</span>),
        <span style="color: #4eee94;">content</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"of course, as you probably already know, people"</span>),
        <span style="color: #4eee94;">reply</span>: <span style="color: #00bfff; font-weight: bold;">false</span>,
        <span style="color: #4eee94;">retweet</span>: <span style="color: #00bfff; font-weight: bold;">false</span>,
    }
}
</pre>
</div>

<p>
通过使用 impl Summary 作为返回值类型，指定了 returns_summarizable 函数返回某个实现了 Summary trait 的类型，但是不确定其具体的类型。在这个例子中 returns_summarizable 返回了一个 Tweet，不过调用方并不知情
</p>

<pre class="example">
返回一个只是指定了需要实现的 trait 的类型的能力在闭包和迭代器场景十分的有用

闭包和迭代器创建只有编译器知道的类型，或者是非常非常长的类型

impl Trait 允许简单的指定函数返回一个 Iterator 而无需写出实际的冗长的类型
</pre>

<p>
不过这只适用于返回 <span class="underline">单一类型</span> 的情况。例如，这段代码的返回值类型指定为返回 impl Summary，但是返回了 NewsArticle 或 Tweet 就行不通：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">returns_summarizable</span>(<span style="color: #4eee94;">switch</span>: <span style="color: #98f5ff;">bool</span>) -&gt; <span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Summary</span> {
    <span style="color: #00bfff; font-weight: bold;">if</span> switch {
        <span style="color: #98f5ff;">NewsArticle</span> {
            <span style="color: #4eee94;">headline</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Penguins win the Stanley Cup Championship!"</span>),
            <span style="color: #4eee94;">location</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Pittsburgh, PA, USA"</span>),
            <span style="color: #4eee94;">author</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Iceburgh"</span>),
            <span style="color: #4eee94;">content</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"The Pittsburgh Penguins once again are the best</span>
<span style="color: #deb887;">            hockey team in the NHL."</span>),
        }
    } <span style="color: #00bfff; font-weight: bold;">else</span> {
        <span style="color: #98f5ff;">Tweet</span> {
            <span style="color: #4eee94;">username</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"horse_ebooks"</span>),
            <span style="color: #4eee94;">content</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"of course, as you probably already know, people"</span>),
            <span style="color: #4eee94;">reply</span>: <span style="color: #00bfff; font-weight: bold;">false</span>,
            <span style="color: #4eee94;">retweet</span>: <span style="color: #00bfff; font-weight: bold;">false</span>,
        }
    }
}
</pre>
</div>

<p>
编译会报如下的错误：
</p>
<div class="org-src-container">
<pre class="src src-sh">error[E0308]: if and else have incompatible types
  --&gt; src/main.rs:88:9
   |
79 |   /     if switch {
80 |   |         NewsArticle {
   |  _|_________-
81 | | |             headline: String::from(<span style="color: #deb887;">"Penguins win the Stanley Cup Championship!"</span>),
82 | | |             location: String::from(<span style="color: #deb887;">"Pittsburgh, PA, USA"</span>),
83 | | |             author: String::from(<span style="color: #deb887;">"Iceburgh"</span>),
84 | | |             content: String::from(<span style="color: #deb887;">"The Pittsburgh Penguins once again are the best</span>
<span style="color: #deb887;">85 | | |             hockey team in the NHL."</span>),
86 | | |         }
   | |_|_________- expected because of this
87 |   |     } <span style="color: #00bfff; font-weight: bold;">else</span> {
88 | / |         Tweet {
89 | | |             username: String::from(<span style="color: #deb887;">"horse_ebooks"</span>),
90 | | |             content: String::from(<span style="color: #deb887;">"of course, as you probably already know, people"</span>),
91 | | |             reply: false,
92 | | |             retweet: false,
93 | | |         }
   | |_|_________^ expected struct <span style="color: #fa8072;">`NewsArticle`</span>, found struct <span style="color: #fa8072;">`Tweet`</span>
94 |   |     }
   |   |_____- if and else have incompatible types
   |
   = note: expected type <span style="color: #fa8072;">`NewsArticle`</span>
              found type <span style="color: #fa8072;">`Tweet`</span>
</pre>
</div>
</div>
</div>
