html/rust/generic.html

<div id="outline-container-org4ae5016" class="outline-3">
<h3 id="org4ae5016">使用 trait bounds 来修复 largest 函数</h3>
<div class="outline-text-3" id="text-org4ae5016">
<pre class="example">
     现在知道了如何使用泛型参数 trait bound 来指定所需的行为
   
     该回到前面示例中，来修复使用泛型类型参数的 largest 函数定义！
</pre>
<p>
回顾一下，最后尝试编译代码时出现的错误是：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0369]: binary operation <span style="color: #fa8072;">`&gt;`</span> cannot be applied to type <span style="color: #fa8072;">`T`</span>
 --&gt; src/main.rs:5:12
  |
5 |         <span style="color: #00bfff; font-weight: bold;">if</span> item &gt; largest {
  |            ^^^^^^^^^^^^^^
  |
  = note: an implementation of <span style="color: #fa8072;">`std::cmp::PartialOrd`</span> might be missing for <span style="color: #fa8072;">`T`</span>
</pre>
</div>

<p>
在 largest 函数体中想要使用大于运算符 &gt; 比较两个 T 类型的值。这个运算符被定义为标准库中 trait <span class="underline">std::cmp::PartialOrd</span> 的一个默认方法。所以需要在 T 的 trait bound 中指定 PartialOrd，这样 largest 函数可以用于任何可以比较大小的类型的 slice。因为 PartialOrd 位于 prelude 中所以并不需要手动将其引入作用域。将 largest 的签名修改为如下：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">largest</span>&lt;<span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">PartialOrd</span>&gt;(<span style="color: #4eee94;">list</span>: &amp;[<span style="color: #98f5ff;">T</span>]) -&gt; <span style="color: #98f5ff;">T</span> {
</pre>
</div>

<p>
但是如果编译代码的话，会出现一些不同的错误：
</p>
<div class="org-src-container">
<pre class="src src-sh">error[E0508]: cannot move out of type <span style="color: #fa8072;">`[T]`</span>, a non-copy slice
 --&gt; src/main.rs:2:23
  |
2 |     <span style="color: #f08080;">let</span> mut largest = list[0];
  |                       ^^^^^^^
  |                       |
  |                       cannot move out of here
  |                       <span style="color: #f08080;">help</span>: consider using a reference instead: <span style="color: #fa8072;">`&amp;list[0]`</span>

error[E0507]: cannot move out of borrowed content
 --&gt; src/main.rs:4:9
  |
4 |     <span style="color: #00bfff; font-weight: bold;">for</span> &amp;item<span style="color: #00bfff; font-weight: bold;"> in</span> list.iter() {
  |         ^----
  |         ||
  |         |hint: to prevent move, use <span style="color: #fa8072;">`ref item`</span> or <span style="color: #fa8072;">`ref mut item`</span>
  |         cannot move out of borrowed content
</pre>
</div>

<pre class="example">
     错误的核心是 cannot move out of type [T], a non-copy slice
   
     对于非泛型版本的 largest 函数，只尝试了寻找最大的 i32 和 char。正如前面 “只在栈上的数据：拷贝” 部分讨论过的，像 i32 和 char 这样的类型是已知大小的并可以储存在栈上，所以他们实现了 Copy trait
   
     将 largest 函数改成使用泛型后，现在 list 参数的类型就有可能是没有实现 Copy trait 的。这意味着可能不能将 list[0] 的值移动到 largest 变量中，这导致了上面的错误
</pre>

<p>
为了只对实现了 Copy 的类型调用这些代码，可以在 T 的 trait bounds 中增加 Copy：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">largest</span>&lt;<span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">PartialOrd</span> + <span style="color: #98f5ff;">Copy</span>&gt;(<span style="color: #4eee94;">list</span>: &amp;[<span style="color: #98f5ff;">T</span>]) -&gt; <span style="color: #98f5ff;">T</span> {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">largest</span> = list[0];

    <span style="color: #00bfff; font-weight: bold;">for</span> &amp;item <span style="color: #00bfff; font-weight: bold;">in</span> list.iter() {
        <span style="color: #00bfff; font-weight: bold;">if</span> item &gt; largest {
            largest = item;
        }
    }

    largest
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">number_list</span> = <span style="color: #ffd700;">vec!</span>[34, 50, 25, 100, 65];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span> = largest(&amp;number_list);
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The largest number is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, result);

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">char_list</span> = <span style="color: #ffd700;">vec!</span>[<span style="color: #deb887;">'y'</span>, <span style="color: #deb887;">'m'</span>, <span style="color: #deb887;">'a'</span>, <span style="color: #deb887;">'q'</span>];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span> = largest(&amp;char_list);
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The largest char is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, result);
}
</pre>
</div>

<pre class="example">
     如果并不希望限制 largest 函数只能用于实现了 Copy trait 的类型，可以在 T 的 trait bounds 中指定 Clone 而不是 Copy，这样将克隆 slice 的每一个值使得 largest 函数拥有其所有权
   
     使用 clone 函数意味着对于类似 String 这样拥有堆上数据的类型，会潜在的分配更多堆上空间，而堆分配在涉及大量数据时可能会相当缓慢
   
</pre>
<p>
另一种 largest 的实现方式是返回在 slice 中 <span class="underline">T 值的引用</span> 。如果将函数返回值从 T 改为 &amp;T 并改变函数体使其能够返回一个引用，将不需要任何 Clone 或 Copy 的 trait bounds 而且也不会有任何的堆分配
</p>
</div>
</div>

<div id="outline-container-orgc34142c" class="outline-3">
<h3 id="orgc34142c">使用 trait bound 有条件地实现方法</h3>
<div class="outline-text-3" id="text-orgc34142c">
<p>
通过使用带有 trait bound 的泛型参数的 impl 块，可以 <b>有条件</b> 地只为那些实现了特定 trait 的类型实现方法。例如：
</p>
<ul class="org-ul">
<li>类型 Pair&lt;T&gt; 总是实现了 new 方法</li>
<li>只有那些为 T 类型实现了 PartialOrd trait  和 Display trait 的 Pair&lt;T&gt; 才会实现 cmp_display 方法</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">use</span> <span style="color: #ffd700;">std</span>::<span style="color: #ffd700;">fmt</span>::<span style="color: #98f5ff;">Display</span>;

<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Pair</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">T</span>,
    <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">T</span>,
}

<span style="color: #00bfff; font-weight: bold;">impl</span>&lt;<span style="color: #98f5ff;">T</span>&gt; <span style="color: #98f5ff;">Pair</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">new</span>(<span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">T</span>, <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">T</span>) -&gt; <span style="color: #98f5ff;">Self</span> {
        <span style="color: #98f5ff;">Self</span> {
            x,
            y,
        }
    }
}

<span style="color: #00bfff; font-weight: bold;">impl</span>&lt;<span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">Display</span> + <span style="color: #98f5ff;">PartialOrd</span>&gt; <span style="color: #98f5ff;">Pair</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">cmp_display</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) {
        <span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #00bfff; font-weight: bold;">self</span>.x &gt;= <span style="color: #00bfff; font-weight: bold;">self</span>.y {
            <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The largest member is x = </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, <span style="color: #00bfff; font-weight: bold;">self</span>.x);
        } <span style="color: #00bfff; font-weight: bold;">else</span> {
            <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The largest member is y = </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, <span style="color: #00bfff; font-weight: bold;">self</span>.y);
        }
    }
}
</pre>
</div>

<p>
也可以对任何实现了特定 trait 的类型有条件地实现 trait。对任何满足特定 trait bound 的类型实现 trait 被称为 <span class="underline">blanket implementations</span> ，他们被广泛的用于 Rust 标准库中。例如，标准库为任何实现了 Display trait 的类型实现了 ToString trait。这个 impl 块看起来像这样：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">impl</span>&lt;<span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">Display</span>&gt; <span style="color: #98f5ff;">ToString</span> <span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #98f5ff;">T</span> {
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">--snip--</span>
}
</pre>
</div>

<p>
因为标准库有了这些 blanket implementation，可以对任何实现了 Display trait 的类型调用由 ToString 定义的 to_string 方法。例如，可以将整型转换为对应的 String 值，因为整型实现了 Display：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s</span> = 3.to_string();
</pre>
</div>
</div>
</div>

<div id="outline-container-org72e038c" class="outline-3">
<h3 id="org72e038c">总结</h3>
<div class="outline-text-3" id="text-org72e038c">
<p>
trait 和 trait bound 让使用泛型类型参数来减少重复，并仍然能够向编译器明确指定泛型类型需要拥有哪些行为。因为向编译器提供了 trait bound 信息，它就可以检查代码中所用到的具体类型是否提供了正确的行为
</p>

<pre class="example">
在动态类型语言中，如果尝试调用一个类型并没有实现的方法，会在运行时出现错误

Rust 将这些错误移动到了编译时，甚至在代码能够运行之前就强迫修复这样的错误

另外，也无需编写运行时检查行为的代码，因为在编译时就已经检查过了，这样相比其他那些不愿放弃泛型灵活性的语言有更好的性能
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf64ed11" class="outline-2">
<h2 id="orgf64ed11">生命周期</h2>
<div class="outline-text-2" id="text-orgf64ed11">
<p>
前面在讨论 <span class="underline">引用和借用</span> 部分时，遗漏了一个重要的细节：Rust 中的每一个引用都有其 <span class="underline">生命周期</span> (lifetime) ，也就是 <b>引用保持有效的作用域</b> 
</p>

<pre class="example">
大部分时候生命周期是隐含并可以推断的，正如大部分时候类型也是可以推断的一样

但是类似于当因为有多种可能类型的时候必须注明类型，也可能会出现引用的生命周期以一些不同方式相关联的情况

Rust 需要使用泛型生命周期参数来注明他们的关系，这样就能确保运行时实际使用的引用绝对是有效的

生命周期的概念某种程度上说不同于其他语言中类似的工具，毫无疑问这是 Rust 最与众不同的功能

这里只会讲到一些通常可能会遇到的生命周期语法以便熟悉这个概念
</pre>
</div>
