html/rust/generic.html
<div id="outline-container-org9c86c94" class="outline-3">
<h3 id="org9c86c94">生命周期避免了悬垂引用</h3>
<div class="outline-text-3" id="text-org9c86c94">
<p>
生命周期的主要目标是 <b>避免悬垂引用</b> ，它会导致程序引用了非预期引用的数据。下面的程序，它有一个外部作用域和一个内部作用域：
</p>

<div class="org-src-container">
<pre class="src src-rust">{
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">r</span>;

    {
        <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">x</span> = 5;
        r = &amp;x;
    }

    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"r: </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, r);
}
</pre>
</div>

<pre class="example">
   注意：这里确实声明了没有初始值的变量，所以这些变量存在于外部作用域。这乍看之下好像和 Rust 不允许存在空值相冲突
   
   然而如果尝试在给它一个值之前使用这个变量，会出现一个编译时错误，这就说明了 Rust 确实不允许空值
</pre>

<ol class="org-ol">
<li>外部作用域声明了一个没有初值的变量 r</li>
<li>内部作用域声明了一个初值为 5 的变量x：在内部作用域中，尝试将 r 的值设置为一个 x 的引用</li>
<li>在内部作用域结束后，尝试打印出 r 的值</li>
</ol>

<p>
这段代码不能编译因为 r 引用的值在 <b>尝试使用之前就离开了作用域</b> 。如下是错误信息：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0597]: <span style="color: #fa8072;">`x`</span> does not live long enough
  --&gt; src/main.rs:7:5
   |
6  |         r = &amp;x;
   |              - borrow occurs here
7  |     }
   |     ^ <span style="color: #fa8072;">`x`</span> dropped here while still borrowed
...
10 | }
   | - borrowed value needs to live until here
</pre>
</div>

<pre class="example">
  变量 x 并没有 “存在的足够久”。其原因是 x 在到达第 7 行内部作用域结束时就离开了作用域

  不过 r 在外部作用域仍是有效的；作用域越大就说它 “存在的越久”

  如果 Rust 允许这段代码工作，r 将会引用在 x 离开作用域时被释放的内存，这时尝试对 r 做任何操作都不能正常工作

  那么 Rust 是如何决定这段代码是不被允许的呢？这得益于借用检查器
</pre>
</div>
<div id="outline-container-orge1441ce" class="outline-4">
<h4 id="orge1441ce">借用检查器</h4>
<div class="outline-text-4" id="text-orge1441ce">
<p>
Rust 编译器有一个 <span class="underline">借用检查器</span> ，它比较作用域来确保所有的借用都是有效的。下面展示了带有变量生命周期的注释：
</p>

<div class="org-src-container">
<pre class="src src-rust">{
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">r</span>;                <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">---------+-- 'a</span>
                          <span style="color: #5f9ea0; font-style: italic;">//          </span><span style="color: #5f9ea0; font-style: italic;">|</span>
    {                     <span style="color: #5f9ea0; font-style: italic;">//          </span><span style="color: #5f9ea0; font-style: italic;">|</span>
        <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">x</span> = 5;        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">-+-- 'b  |</span>
        r = &amp;x;           <span style="color: #5f9ea0; font-style: italic;">//  </span><span style="color: #5f9ea0; font-style: italic;">|       |</span>
    }                     <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">-+       |</span>
                          <span style="color: #5f9ea0; font-style: italic;">//          </span><span style="color: #5f9ea0; font-style: italic;">|</span>
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"r: </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, r); <span style="color: #5f9ea0; font-style: italic;">//          </span><span style="color: #5f9ea0; font-style: italic;">|</span>
}              
</pre>
</div>

<p>
这里将 <span class="underline">r</span> 的生命周期标记为 <span class="underline">'a</span>  并将 <span class="underline">x</span> 的生命周期标记为 <span class="underline">'b</span> ，内部的 'b 块要比外部的生命周期 'a 小得多
</p>

<pre class="example">
    在编译时，Rust 比较这两个生命周期的大小，并发现 r 拥有生命周期 'a，不过它引用了一个拥有生命周期 'b 的对象
    
    程序被拒绝编译，因为生命周期 'b 比生命周期 'a 要小：被引用的对象比它的引用者存在的时间更短 
</pre>

<p>
现在修改成没有产生悬垂引用且可以正确编译：
</p>

<div class="org-src-container">
<pre class="src src-rust">{
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">x</span> = 5;            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">----------+-- 'b</span>
                          <span style="color: #5f9ea0; font-style: italic;">//           </span><span style="color: #5f9ea0; font-style: italic;">|</span>
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">r</span> = &amp;x;           <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">--+-- 'a  |</span>
                          <span style="color: #5f9ea0; font-style: italic;">//   </span><span style="color: #5f9ea0; font-style: italic;">|       |</span>
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"r: </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, r); <span style="color: #5f9ea0; font-style: italic;">//   </span><span style="color: #5f9ea0; font-style: italic;">|       |</span>
                          <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">--+       |</span>
}                         <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">----------+</span>
</pre>
</div>

<p>
这里 x 拥有生命周期 'b，比 'a 要大
</p>

<pre class="example">
    这就意味着 r 可以引用 x：Rust 知道 r 中的引用在 x 有效的时候也总是有效的
</pre>

<p>
接下来看看在 <span class="underline">函数的上下文</span> 中 <span class="underline">参数</span> 和 <span class="underline">返回值</span> 的 <span class="underline">泛型生命周期</span> 
</p>
</div>
</div>
</div>
<div id="outline-container-org9f6fdff" class="outline-3">
<h3 id="org9f6fdff">函数中的泛型生命周期</h3>
<div class="outline-text-3" id="text-org9f6fdff">
<p>
假设有一个返回两个字符串 slice 中较长者的函数。这个函数获取两个字符串 slice 并返回一个字符串 slice：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">string1</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"abcd"</span>);
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">string2</span> = <span style="color: #deb887;">"xyz"</span>;

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span> = longest(string1.as_str(), string2);
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The longest string is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, result);
}
</pre>
</div>

<pre class="example">
   注意：这个函数获取作为引用的字符串 slice，因为不希望 longest 函数获取参数的所有权，期望该函数接受 String 的 slice 和 字符串字面值
</pre>

<p>
上面代码应该会打印出：
</p>
<div class="org-src-container">
<pre class="src src-sh">The longest string is abcd 
</pre>
</div>

<p>
如果尝试像下面那样来实现 longest 函数，它并不能编译：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">longest</span>(<span style="color: #4eee94;">x</span>: &amp;<span style="color: #98f5ff;">str</span>, <span style="color: #4eee94;">y</span>: &amp;<span style="color: #98f5ff;">str</span>) -&gt; &amp;<span style="color: #98f5ff;">str</span> {
    <span style="color: #00bfff; font-weight: bold;">if</span> x.len() &gt; y.len() {
        x
    } <span style="color: #00bfff; font-weight: bold;">else</span> {
        y
    }
}
</pre>
</div>

<p>
相应地会出现如下有关生命周期的错误：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0106]: missing lifetime specifier
 --&gt; src/main.rs:1:33
  |
1 | fn longest(x: &amp;str, y: &amp;str) -&gt; &amp;str {
  |                                 ^ expected lifetime parameter
  |
  = help: this <span style="color: #00bfff; font-weight: bold;">function</span><span style="color: #deb887;">'s return type contains a borrowed value, but the</span>
<span style="color: #deb887;">signature does not say whether it is borrowed from `x` or `y`</span>
</pre>
</div>

<p>
报错显示了 <span class="underline">返回值</span> 需要一个 <span class="underline">泛型生命周期参数</span> ，因为 Rust 并不知道将要返回的引用是指向 x 或 y。事实上我们也不知道，因为函数体中 if 块返回一个 x 的引用而 else 块返回一个 y 的引用 
</p>

<pre class="example">
   当定义这个函数的时候，并不知道传递给函数的具体值，所以也不知道到底是 if 还是 else 会被执行
   
   同样也不知道传入的引用的具体生命周期，所以也就不能通过观察作用域来确定返回的引用是否总是有效
   
   借用检查器自身同样也无法确定，因为它不知道 x 和 y 的生命周期是如何与返回值的生命周期相关联的
</pre>

<p>
为了修复这个错误，必须增加泛型生命周期参数来定义引用间的关系以便借用检查器可以进行分析
</p>
</div>
</div>
<div id="outline-container-org099d29a" class="outline-3">
<h3 id="org099d29a">生命周期注解语法</h3>
<div class="outline-text-3" id="text-org099d29a">
<p>
生命周期注解并 <b>不改变</b> 任何引用的 <span class="underline">生命周期的长短</span> 。与当函数签名中指定了泛型类型参数后就可以接受任何类型一样，当指定了泛型生命周期后函数也能 <b>接受</b> 任何 <span class="underline">生命周期的引用</span> 。生命周期注解 <b>描述</b> 了 <span class="underline">多个引用</span> 生命周期 <span class="underline">相互的关系</span> ，而不影响其生命周期。生命周期注解有着一个不太常见的语法：
</p>
<ul class="org-ul">
<li>生命周期参数名称必须以撇号 (') 开头</li>
<li>名称通常全是小写，类似于泛型其名称非常短。'a 是大多数人默认使用的名称</li>
<li>生命周期参数注解位于 <span class="underline">引用的 &amp;</span> 之后，并有 <span class="underline">一个空格</span> 来将引用类型与生命周期注解分隔开</li>
</ul>

<p>
这里有一些例子：有一个没有生命周期参数的 i32 的引用，一个有叫做 'a 的生命周期参数的 i32 的引用，和一个生命周期也是 'a 的 i32 的可变引用：
</p>

<div class="org-src-container">
<pre class="src src-rust">&amp;<span style="color: #98f5ff;">i32</span>        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#24341;&#29992;</span>
&amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">i32</span>     <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#24102;&#26377;&#26174;&#24335;&#29983;&#21629;&#21608;&#26399;&#30340;&#24341;&#29992;</span>
&amp;'<span style="color: #4eee94;">a</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #98f5ff;">i32</span> <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#24102;&#26377;&#26174;&#24335;&#29983;&#21629;&#21608;&#26399;&#30340;&#21487;&#21464;&#24341;&#29992;</span>
</pre>
</div>

<p>
单个的生命周期注解本身没有多少意义，因为生命周期注解告诉 Rust 多个引用的泛型生命周期参数如何相互联系的
</p>

<pre class="example">
  如果函数有一个生命周期 'a 的 i32 的引用的参数 first，还有另一个同样是生命周期 'a 的 i32 的引用的参数 second

  这两个生命周期注解意味着引用 first 和 second 必须与这泛型生命周期存在得一样久
</pre>
</div>
</div>
