src/rust/generic.org
** 函数签名中的生命周期注解
   回过来看下前面的longest函数。就像泛型类型参数，泛型生命周期参数需要声明在函数名和参数列表间的尖括号中。这里想要告诉 Rust 关于参数中的引用和返回值之间的限制是他们都必须拥有相同的生命周期，就像前面在每个引用中都加上了 'a 那样：
   
   #+BEGIN_SRC rust 
  fn longest<'a>(x: &'a str, y: &'a str) -> &'a str {
      if x.len() > y.len() {
          x
      } else {
          y
      }
  }
   #+END_SRC
   
   这个函数签名表明对于某些生命周期 'a：
+ 函数会获取两个参数，他们都是与生命周期 'a 存在的一样长的字符串 slice
+ 函数会返回一个同样也与生命周期 'a 存在的一样长的字符串 slice
  
#+BEGIN_EXAMPLE
  这就是告诉 Rust 需要其保证的契约：

  通过在函数签名中指定生命周期参数时，并没有改变任何传入后返回的值的生命周期，而是指出任何不遵守这个协议的传入值都将被借用检查器拒绝

  注意： longest 函数并不需要知道 x 和 y 具体会存在多久，而只需要知道有某个可以被 'a 替代的作用域将会满足这个签名
#+END_EXAMPLE

运行这段代码后会看到想要的输出：

#+BEGIN_SRC sh 
The longest string is abcd
#+END_SRC

当在函数中使用生命周期注解时，这些注解出现在函数签名中，而 *不存在* 于 _函数体_ 的 _任何代码_ 中，因为 Rust 能够分析函数中代码而不需要任何协助，不过当函数引用或被函数之外的代码引用时，让 Rust 自身分析出参数或返回值的生命周期几乎是不可能的，而这些生命周期在每次函数被调用时都可能不同

#+BEGIN_EXAMPLE
  当具体的引用被传递给 longest 时，被 'a 所替代的具体生命周期是 x 的作用域与 y 的作用域相重叠的那一部分

  换一种说法就是泛型生命周期 'a 的具体生命周期等同于 x 和 y 的生命周期中较小的那一个

  因为用相同的生命周期参数 'a 标注了返回的引用值，所以返回的引用值就能保证在 x 和 y 中较短的那个生命周期结束之前保持有效
#+END_EXAMPLE

现在来看看如何通过传递拥有 _不同_ 具体生命周期的引用来限制 longest 函数的使用。下面是一个很直观的例子：

#+BEGIN_SRC rust 
  fn main() {
      let string1 = String::from("long string is long");

      {
          let string2 = String::from("xyz");
          let result = longest(string1.as_str(), string2.as_str());
          println!("The longest string is {}", result);
      }
  }
#+END_SRC

#+BEGIN_EXAMPLE
  在这个例子中，string1 直到外部作用域结束都是有效的，string2 则在内部作用域中是有效的，而result 则引用了一些直到内部作用域结束都是有效的值

  借用检查器认可这些代码，它能够编译和运行，并打印出 "The longest string is long string is long" 
#+END_EXAMPLE

下面将 result 变量的声明移动出内部作用域，但是将 result 和 string2 变量的赋值语句一同留在内部作用域中。接着，使用了变量 result 的 println! 也被移动到内部作用域之外：

#+BEGIN_SRC rust 
  fn main() {
      let string1 = String::from("long string is long");
      let result;
      {
          let string2 = String::from("xyz");
          result = longest(string1.as_str(), string2.as_str());
      }
      println!("The longest string is {}", result);
  }
#+END_SRC

如果尝试编译会出现如下错误：
#+BEGIN_SRC sh 
  error[E0597]: `string2` does not live long enough
    --> src/main.rs:22:44
     |
  22 |         result = longest(string1.as_str(), string2.as_str());
     |                                            ^^^^^^^ borrowed value does not live long enough
  23 |     }
     |     - `string2` dropped here while still borrowed
  24 |     println!("The longest string is {}", result);
     |                                          ------ borrow later used here
#+END_SRC

错误表明为了保证 println! 中的 result 是有效的， _string2_ 需要直到 _外部作用域结束_ 都是 *有效的* 。Rust 知道这些是因为 _longest_ 函数的参数和返回值都使用了 *相同的生命周期参数*  'a 

#+BEGIN_EXAMPLE
  如果从人的角度读上述代码，可能会觉得这个代码是正确的：string1 更长，因此 result 会包含指向 string1 的引用。因为 string1 尚未离开作用域，对于 println! 来说 string1 的引用仍然是有效的

  然而，通过生命周期参数告诉 Rust 的是： longest 函数返回的引用的生命周期应该与传入参数的生命周期中较短那个保持一致。因此，借用检查器不允许这样的代码，因为它可能会存在无效的引用

  这个例子揭示了 result 的引用的生命周期必须是两个参数中较短的那个
#+END_EXAMPLE
** 深入理解生命周期
   指定 _生命周期参数_ 的 _正确方式_ *依赖* 函数实现的 _具体功能_ 。例如，如果将 longest 函数的实现修改为总是返回第一个参数而不是最长的字符串 slice，就不需要为参数 y 指定一个生命周期。如下代码将能够编译：
   
   #+BEGIN_SRC rust 
  fn longest<'a>(x: &'a str, y: &str) -> &'a str {
      x
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   在这个例子中，为参数 x 和返回值指定了生命周期参数 'a，不过没有为参数 y 指定，因为 y 的生命周期与参数 x 和返回值的生命周期没有任何关系
   #+END_EXAMPLE
   
   当从函数 _返回_ 一个 _引用_ ， _返回值的生命周期参数_ 需要与一个 _参数的生命周期参数相匹配_ 。如果返回的引用 *没有* 指向 _任何一个参数_ ，那么唯一的可能就是它指向一个函数内部创建的值，它将会是一个 *悬垂引用* ，因为它将会在函数结束时离开作用域。尝试考虑这个并不能编译的 longest 函数实现：
   
   #+BEGIN_SRC rust 
  fn longest<'a>(x: &str, y: &str) -> &'a str {
      let result = String::from("really long string");
      result.as_str()
  }
   #+END_SRC
   
   即便为返回值指定了生命周期参数 'a，这个实现却编译失败了，因为返回值的生命周期与参数完全没有关联。这里是会出现的错误信息：
   
   #+BEGIN_SRC sh 
  error[E0597]: `result` does not live long enough
   --> src/main.rs:3:5
    |
  3 |     result.as_str()
    |     ^^^^^^ does not live long enough
  4 | }
    | - borrowed value only lives until here
    |
  note: borrowed value must be valid for the lifetime 'a as defined on the
  function body at 1:1...
   --> src/main.rs:1:1
    |
  1 | / fn longest<'a>(x: &str, y: &str) -> &'a str {
  2 | |     let result = String::from("really long string");
  3 | |     result.as_str()
  4 | | }
    | |_^
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   result 在 longest 函数的结尾将离开作用域并被清理 ，这个 result 的引用就变成了一个悬垂引用
   
   由此可见，仍然无法指定生命周期参数来改变悬垂引用
   #+END_EXAMPLE
   
   在这种情况，最好的解决方案是返回一个有所有权的数据类型而不是一个引用，这样函数调用者就需要负责清理这个值了
   
   #+BEGIN_EXAMPLE
   生命周期语法是用于将函数的多个参数与其返回值的生命周期进行关联的
   
   一旦他们形成了某种关联，Rust 就有了足够的信息来允许内存安全的操作并阻止会产生悬垂指针亦或是违反内存安全的行为
   #+END_EXAMPLE
