html/rust/generic.html
<div id="outline-container-org6d0b6bc" class="outline-3">
<h3 id="org6d0b6bc">函数签名中的生命周期注解</h3>
<div class="outline-text-3" id="text-org6d0b6bc">
<p>
回过来看下前面的longest函数。就像泛型类型参数，泛型生命周期参数需要声明在函数名和参数列表间的尖括号中。这里想要告诉 Rust 关于参数中的引用和返回值之间的限制是他们都必须拥有相同的生命周期，就像前面在每个引用中都加上了 'a 那样：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">longest</span>&lt;'<span style="color: #4eee94;">a</span>&gt;(<span style="color: #4eee94;">x</span>: &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span>, <span style="color: #4eee94;">y</span>: &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span>) -&gt; &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span> {
    <span style="color: #00bfff; font-weight: bold;">if</span> x.len() &gt; y.len() {
        x
    } <span style="color: #00bfff; font-weight: bold;">else</span> {
        y
    }
}
</pre>
</div>

<p>
这个函数签名表明对于某些生命周期 'a：
</p>
<ul class="org-ul">
<li>函数会获取两个参数，他们都是与生命周期 'a 存在的一样长的字符串 slice</li>
<li>函数会返回一个同样也与生命周期 'a 存在的一样长的字符串 slice</li>
</ul>

<pre class="example">
  这就是告诉 Rust 需要其保证的契约：

  通过在函数签名中指定生命周期参数时，并没有改变任何传入后返回的值的生命周期，而是指出任何不遵守这个协议的传入值都将被借用检查器拒绝

  注意： longest 函数并不需要知道 x 和 y 具体会存在多久，而只需要知道有某个可以被 'a 替代的作用域将会满足这个签名
</pre>

<p>
运行这段代码后会看到想要的输出：
</p>

<div class="org-src-container">
<pre class="src src-sh">The longest string is abcd
</pre>
</div>

<p>
当在函数中使用生命周期注解时，这些注解出现在函数签名中，而 <b>不存在</b> 于 <span class="underline">函数体</span> 的 <span class="underline">任何代码</span> 中，因为 Rust 能够分析函数中代码而不需要任何协助，不过当函数引用或被函数之外的代码引用时，让 Rust 自身分析出参数或返回值的生命周期几乎是不可能的，而这些生命周期在每次函数被调用时都可能不同
</p>

<pre class="example">
  当具体的引用被传递给 longest 时，被 'a 所替代的具体生命周期是 x 的作用域与 y 的作用域相重叠的那一部分

  换一种说法就是泛型生命周期 'a 的具体生命周期等同于 x 和 y 的生命周期中较小的那一个

  因为用相同的生命周期参数 'a 标注了返回的引用值，所以返回的引用值就能保证在 x 和 y 中较短的那个生命周期结束之前保持有效
</pre>

<p>
现在来看看如何通过传递拥有 <span class="underline">不同</span> 具体生命周期的引用来限制 longest 函数的使用。下面是一个很直观的例子：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">string1</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"long string is long"</span>);

    {
        <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">string2</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"xyz"</span>);
        <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span> = longest(string1.as_str(), string2.as_str());
        <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The longest string is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, result);
    }
}
</pre>
</div>

<pre class="example">
  在这个例子中，string1 直到外部作用域结束都是有效的，string2 则在内部作用域中是有效的，而result 则引用了一些直到内部作用域结束都是有效的值

  借用检查器认可这些代码，它能够编译和运行，并打印出 "The longest string is long string is long" 
</pre>

<p>
下面将 result 变量的声明移动出内部作用域，但是将 result 和 string2 变量的赋值语句一同留在内部作用域中。接着，使用了变量 result 的 println! 也被移动到内部作用域之外：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">string1</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"long string is long"</span>);
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span>;
    {
        <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">string2</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"xyz"</span>);
        result = longest(string1.as_str(), string2.as_str());
    }
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The longest string is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, result);
}
</pre>
</div>

<p>
如果尝试编译会出现如下错误：
</p>
<div class="org-src-container">
<pre class="src src-sh">error[E0597]: <span style="color: #fa8072;">`string2`</span> does not live long enough
  --&gt; src/main.rs:22:44
   |
22 |         result = longest(string1.as_str(), string2.as_str());
   |                                            ^^^^^^^ borrowed value does not live long enough
23 |     }
   |     - <span style="color: #fa8072;">`string2`</span> dropped here while still borrowed
24 |     println!(<span style="color: #deb887;">"The longest string is {}"</span>, result);
   |                                          ------ borrow later used here
</pre>
</div>

<p>
错误表明为了保证 println! 中的 result 是有效的， <span class="underline">string2</span> 需要直到 <span class="underline">外部作用域结束</span> 都是 <b>有效的</b> 。Rust 知道这些是因为 <span class="underline">longest</span> 函数的参数和返回值都使用了 <b>相同的生命周期参数</b>  'a 
</p>

<pre class="example">
  如果从人的角度读上述代码，可能会觉得这个代码是正确的：string1 更长，因此 result 会包含指向 string1 的引用。因为 string1 尚未离开作用域，对于 println! 来说 string1 的引用仍然是有效的

  然而，通过生命周期参数告诉 Rust 的是： longest 函数返回的引用的生命周期应该与传入参数的生命周期中较短那个保持一致。因此，借用检查器不允许这样的代码，因为它可能会存在无效的引用

  这个例子揭示了 result 的引用的生命周期必须是两个参数中较短的那个
</pre>
</div>
</div>
<div id="outline-container-org6dcba41" class="outline-3">
<h3 id="org6dcba41">深入理解生命周期</h3>
<div class="outline-text-3" id="text-org6dcba41">
<p>
指定 <span class="underline">生命周期参数</span> 的 <span class="underline">正确方式</span> <b>依赖</b> 函数实现的 <span class="underline">具体功能</span> 。例如，如果将 longest 函数的实现修改为总是返回第一个参数而不是最长的字符串 slice，就不需要为参数 y 指定一个生命周期。如下代码将能够编译：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">longest</span>&lt;'<span style="color: #4eee94;">a</span>&gt;(<span style="color: #4eee94;">x</span>: &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span>, <span style="color: #4eee94;">y</span>: &amp;<span style="color: #98f5ff;">str</span>) -&gt; &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span> {
    x
}
</pre>
</div>

<pre class="example">
   在这个例子中，为参数 x 和返回值指定了生命周期参数 'a，不过没有为参数 y 指定，因为 y 的生命周期与参数 x 和返回值的生命周期没有任何关系
</pre>

<p>
当从函数 <span class="underline">返回</span> 一个 <span class="underline">引用</span> ， <span class="underline">返回值的生命周期参数</span> 需要与一个 <span class="underline">参数的生命周期参数相匹配</span> 。如果返回的引用 <b>没有</b> 指向 <span class="underline">任何一个参数</span> ，那么唯一的可能就是它指向一个函数内部创建的值，它将会是一个 <b>悬垂引用</b> ，因为它将会在函数结束时离开作用域。尝试考虑这个并不能编译的 longest 函数实现：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">longest</span>&lt;'<span style="color: #4eee94;">a</span>&gt;(<span style="color: #4eee94;">x</span>: &amp;<span style="color: #98f5ff;">str</span>, <span style="color: #4eee94;">y</span>: &amp;<span style="color: #98f5ff;">str</span>) -&gt; &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span> {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">result</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"really long string"</span>);
    result.as_str()
}
</pre>
</div>

<p>
即便为返回值指定了生命周期参数 'a，这个实现却编译失败了，因为返回值的生命周期与参数完全没有关联。这里是会出现的错误信息：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0597]: <span style="color: #fa8072;">`result`</span> does not live long enough
 --&gt; src/main.rs:3:5
  |
3 |     result.as_str()
  |     ^^^^^^ does not live long enough
4 | }
  | - borrowed value only lives until here
  |
note: borrowed value must be valid for the lifetime <span style="color: #deb887;">'a as defined on the</span>
<span style="color: #deb887;">function body at 1:1...</span>
<span style="color: #deb887;"> --&gt; src/main.rs:1:1</span>
<span style="color: #deb887;">  |</span>
<span style="color: #deb887;">1 | / fn longest&lt;'</span>a&gt;(x: &amp;str, y: &amp;str) -&gt; &amp;<span style="color: #deb887;">'a str {</span>
<span style="color: #deb887;">2 | |     let result = String::from("really long string");</span>
<span style="color: #deb887;">3 | |     result.as_str()</span>
<span style="color: #deb887;">4 | | }</span>
<span style="color: #deb887;">  | |_^</span>
</pre>
</div>

<pre class="example">
result 在 longest 函数的结尾将离开作用域并被清理 ，这个 result 的引用就变成了一个悬垂引用

由此可见，仍然无法指定生命周期参数来改变悬垂引用
</pre>

<p>
在这种情况，最好的解决方案是返回一个有所有权的数据类型而不是一个引用，这样函数调用者就需要负责清理这个值了
</p>

<pre class="example">
   生命周期语法是用于将函数的多个参数与其返回值的生命周期进行关联的
   
   一旦他们形成了某种关联，Rust 就有了足够的信息来允许内存安全的操作并阻止会产生悬垂指针亦或是违反内存安全的行为
</pre>
</div>
</div>
