src/rust/generic.org
** 结构体定义中的生命周期注解
   接下来，将定义包含引用的结构体，不过这需要为结构体定义中的 _每一个引用_ 添加 _生命周期注解_ 。下面示例中有一个存放了一个字符串 _slice_ 的结构体：
   
   #+BEGIN_SRC rust 
  struct ImportantExcerpt<'a> {
      part: &'a str,
  }

  fn main() {
      let novel = String::from("Call me Ishmael. Some years ago...");
      let first_sentence = novel.split('.')
          .next()
          .expect("Could not find a '.'");
      let i = ImportantExcerpt { part: first_sentence };
  }
   #+END_SRC
   
   这个结构体有一个字段，part，它存放了一个字符串 slice，这是一个引用：
+ 类似于泛型参数类型，必须在 _结构体名称_ 后面的 _尖括号_ 中 *声明* _泛型生命周期参数_ ，以便在结构体定义中使用生命周期参数
+ 这个注解意味着 _ImportantExcerpt_ 的实例 *不能比* 其 _part_ 字段中的引用 *存在的更久* 
  
#+BEGIN_EXAMPLE
  main 函数创建了一个 ImportantExcerpt 的实例，它存放了变量 novel 所拥有的 String 的第一个句子的引用

  novel 的数据在 ImportantExcerpt 实例创建之前就存在

  直到 ImportantExcerpt 离开作用域之后 novel 都不会离开作用域，所以 ImportantExcerpt 实例中的引用是有效的
#+END_EXAMPLE
** 生命周期省略
   #+BEGIN_EXAMPLE
   现在已经知道了每一个引用都有一个生命周期，而且需要为那些使用了引用的函数或结构体指定生命周期
   #+END_EXAMPLE
   然而，前面几章中却有一个实例，它没有生命周期注解却能编译成功：
   
   #+BEGIN_SRC rust 
  fn first_word(s: &str) -> &str {
      let bytes = s.as_bytes();

      for (i, &item) in bytes.iter().enumerate() {
          if item == b' ' {
              return &s[0..i];
          }
      }

      &s[..]
  }
   #+END_SRC
   
   在早期版本的 Rust 中，这的确是不能编译的。每一个引用都必须有明确的生命周期。那时的函数签名将会写成这样：
   #+BEGIN_SRC rust 
  fn first_word<'a>(s: &'a str) -> &'a str {
   #+END_SRC
   
   在编写了很多 Rust 代码后，Rust 团队发现在特定情况下程序员们总是重复地编写一模一样的生命周期注解。这些场景是可预测的并且遵循几个明确的模式。接着 Rust 团队就把这些模式编码进了 Rust 编译器中，如此借用检查器在这些情况下就能推断出生命周期而不再强制程序员显式的增加注解
   
   #+BEGIN_EXAMPLE
   这里提到一些 Rust 的历史是因为更多的明确的模式被合并和添加到编译器中是完全可能的
   
   未来只会需要更少的生命周期注解
   #+END_EXAMPLE
   
   被编码进 Rust 引用分析的模式被称为 _生命周期省略规则_ 
   
   #+BEGIN_EXAMPLE
   这并不是需要程序员遵守的规则；这些规则是一系列特定的场景，此时编译器会考虑，如果代码符合这些场景，就无需明确指定生命周期
   
   省略规则并不提供完整的推断：如果 Rust 在明确遵守这些规则的前提下变量的生命周期仍然是模棱两可的话，它不会猜测剩余引用的生命周期应该是什么。在这种情况，编译器会给出一个错误，这可以通过增加对应引用之间相联系的生命周期注解来解决
   
   #+END_EXAMPLE
   
   _函数_ 或 _方法的参数_ 的生命周期被称为 _输入生命周期_ ，而 _返回值_ 的生命周期被称为 _输出生命周期_ 。编译器采用三条规则来判断引用何时不需要明确的注解：
+ 第一条规则：每一个 _引用的参数_ 都有它 *自己的* _生命周期参数_ 
#+BEGIN_EXAMPLE
  换句话说就是，有一个引用参数的函数有一个生命周期参数

  例如： fn foo<'a>(x: &'a i32)，有两个引用参数的函数可以有两个不同的生命周期参数，fn foo<'a, 'b>(x: &'a i32, y: &'b i32)，依此类推
#+END_EXAMPLE
+ 第二条规则：如果 *只有一个* _输入生命周期参数_ ，那么它被 *赋予所有* _输出生命周期参数_ 
#+BEGIN_EXAMPLE
fn foo<'a>(x: &'a i32) -> &'a i32
#+END_EXAMPLE
+ 第三条规则：如果方法有 *多个* _输入生命周期参数_ ，不过其中之一因为方法的缘故为 _&self_ 或 _&mut self_ ，那么 _self 的生命周期_ 被 *赋给所有* _输出生命周期参数_
#+BEGIN_EXAMPLE
第三条规则使得方法更容易读写，因为只需更少的符号
#+END_EXAMPLE

如果编译器 _检查_ 完这三条规则后仍然 *存在* _没有计算_ 出 _生命周期的引用_ ，编译器将会 *停止并生成错误* 。这些规则适用于 _fn_ 定义，以及 _impl 块_  
*** 规则应用
    假设我们自己就是编译器。并应用这些规则来计算示例上面的 first_word 函数签名中的引用的生命周期。开始时签名中的引用并没有关联任何生命周期：
    #+BEGIN_SRC rust 
  fn first_word(s: &str) -> &str {
    #+END_SRC
    
    编译器应用第一条规则，也就是每个引用参数都有其自己的生命周期。像往常一样称之为 'a，所以现在签名看起来像这样：
    
    #+BEGIN_SRC rust 
  fn first_word<'a>(s: &'a str) -> &str {
    #+END_SRC
    对于第二条规则，因为这里正好只有一个输入生命周期参数所以是适用的。第二条规则表明输入参数的生命周期将被赋予输出生命周期参数，所以现在签名看起来像这样：
    #+BEGIN_SRC rust 
  fn first_word<'a>(s: &'a str) -> &'a str {
    #+END_SRC
    
    #+BEGIN_EXAMPLE
    现在这个函数签名中的所有引用都有了生命周期，如此编译器可以继续它的分析而无须程序员标记这个函数签名中的生命周期
    #+END_EXAMPLE
    
    再看看另一个例子，这次从前面中没有生命周期参数的 longest 函数开始：
    
    #+BEGIN_SRC rust 
  fn longest(x: &str, y: &str) -> &str {
    #+END_SRC
    
    再次假设我们自己就是编译器并应用第一条规则：每个引用参数都有其自己的生命周期。这次有两个参数，所以就有两个不同的生命周期：
    #+BEGIN_SRC rust 
  fn longest<'a, 'b>(x: &'a str, y: &'b str) -> &str {
    #+END_SRC
    
    再来应用第二条规则，因为函数存在多个输入生命周期，它并不适用于这种情况。再来看第三条规则，它同样也不适用，这是因为没有 self 参数
    
    #+BEGIN_EXAMPLE
    应用了三个规则之后编译器还没有计算出返回值类型的生命周期
    
    这就是为什么在编译代码时会出现错误的原因：编译器使用所有已知的生命周期省略规则，仍不能计算出签名中所有引用的生命周期
    #+END_EXAMPLE
    
