html/rust/generic.html
<div id="outline-container-orgafb53f3" class="outline-3">
<h3 id="orgafb53f3">结构体定义中的生命周期注解</h3>
<div class="outline-text-3" id="text-orgafb53f3">
<p>
接下来，将定义包含引用的结构体，不过这需要为结构体定义中的 <span class="underline">每一个引用</span> 添加 <span class="underline">生命周期注解</span> 。下面示例中有一个存放了一个字符串 <span class="underline">slice</span> 的结构体：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">ImportantExcerpt</span>&lt;'<span style="color: #4eee94;">a</span>&gt; {
    <span style="color: #4eee94;">part</span>: &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span>,
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">novel</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Call me Ishmael. Some years ago..."</span>);
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">first_sentence</span> = novel.split(<span style="color: #deb887;">'.'</span>)
        .next()
        .expect(<span style="color: #deb887;">"Could not find a '.'"</span>);
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">i</span> = <span style="color: #98f5ff;">ImportantExcerpt</span> { <span style="color: #4eee94;">part</span>: first_sentence };
}
</pre>
</div>

<p>
这个结构体有一个字段，part，它存放了一个字符串 slice，这是一个引用：
</p>
<ul class="org-ul">
<li>类似于泛型参数类型，必须在 <span class="underline">结构体名称</span> 后面的 <span class="underline">尖括号</span> 中 <b>声明</b> <span class="underline">泛型生命周期参数</span> ，以便在结构体定义中使用生命周期参数</li>
<li>这个注解意味着 <span class="underline">ImportantExcerpt</span> 的实例 <b>不能比</b> 其 <span class="underline">part</span> 字段中的引用 <b>存在的更久</b></li>
</ul>

<pre class="example">
main 函数创建了一个 ImportantExcerpt 的实例，它存放了变量 novel 所拥有的 String 的第一个句子的引用

novel 的数据在 ImportantExcerpt 实例创建之前就存在

直到 ImportantExcerpt 离开作用域之后 novel 都不会离开作用域，所以 ImportantExcerpt 实例中的引用是有效的
</pre>
</div>
</div>
<div id="outline-container-org33292b3" class="outline-3">
<h3 id="org33292b3">生命周期省略</h3>
<div class="outline-text-3" id="text-org33292b3">
<pre class="example">
   现在已经知道了每一个引用都有一个生命周期，而且需要为那些使用了引用的函数或结构体指定生命周期
</pre>
<p>
然而，前面几章中却有一个实例，它没有生命周期注解却能编译成功：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">first_word</span>(<span style="color: #4eee94;">s</span>: &amp;<span style="color: #98f5ff;">str</span>) -&gt; &amp;<span style="color: #98f5ff;">str</span> {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">bytes</span> = s.as_bytes();

    <span style="color: #00bfff; font-weight: bold;">for</span> (i, &amp;item) <span style="color: #00bfff; font-weight: bold;">in</span> bytes.iter().enumerate() {
        <span style="color: #00bfff; font-weight: bold;">if</span> item == b<span style="color: #deb887;">' '</span> {
            <span style="color: #00bfff; font-weight: bold;">return</span> &amp;s[0..i];
        }
    }

    &amp;s[..]
}
</pre>
</div>

<p>
在早期版本的 Rust 中，这的确是不能编译的。每一个引用都必须有明确的生命周期。那时的函数签名将会写成这样：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">first_word</span>&lt;'<span style="color: #4eee94;">a</span>&gt;(<span style="color: #4eee94;">s</span>: &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span>) -&gt; &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span> {
</pre>
</div>

<p>
在编写了很多 Rust 代码后，Rust 团队发现在特定情况下程序员们总是重复地编写一模一样的生命周期注解。这些场景是可预测的并且遵循几个明确的模式。接着 Rust 团队就把这些模式编码进了 Rust 编译器中，如此借用检查器在这些情况下就能推断出生命周期而不再强制程序员显式的增加注解
</p>

<pre class="example">
   这里提到一些 Rust 的历史是因为更多的明确的模式被合并和添加到编译器中是完全可能的
   
   未来只会需要更少的生命周期注解
</pre>

<p>
被编码进 Rust 引用分析的模式被称为 <span class="underline">生命周期省略规则</span> 
</p>

<pre class="example">
   这并不是需要程序员遵守的规则；这些规则是一系列特定的场景，此时编译器会考虑，如果代码符合这些场景，就无需明确指定生命周期
   
   省略规则并不提供完整的推断：如果 Rust 在明确遵守这些规则的前提下变量的生命周期仍然是模棱两可的话，它不会猜测剩余引用的生命周期应该是什么。在这种情况，编译器会给出一个错误，这可以通过增加对应引用之间相联系的生命周期注解来解决
   
</pre>

<p>
<span class="underline">函数</span> 或 <span class="underline">方法的参数</span> 的生命周期被称为 <span class="underline">输入生命周期</span> ，而 <span class="underline">返回值</span> 的生命周期被称为 <span class="underline">输出生命周期</span> 。编译器采用三条规则来判断引用何时不需要明确的注解：
</p>
<ul class="org-ul">
<li>第一条规则：每一个 <span class="underline">引用的参数</span> 都有它 <b>自己的</b> <span class="underline">生命周期参数</span></li>
</ul>
<pre class="example">
  换句话说就是，有一个引用参数的函数有一个生命周期参数

  例如： fn foo&lt;'a&gt;(x: &amp;'a i32)，有两个引用参数的函数可以有两个不同的生命周期参数，fn foo&lt;'a, 'b&gt;(x: &amp;'a i32, y: &amp;'b i32)，依此类推
</pre>
<ul class="org-ul">
<li>第二条规则：如果 <b>只有一个</b> <span class="underline">输入生命周期参数</span> ，那么它被 <b>赋予所有</b> <span class="underline">输出生命周期参数</span></li>
</ul>
<pre class="example">
fn foo&lt;'a&gt;(x: &amp;'a i32) -&gt; &amp;'a i32
</pre>
<ul class="org-ul">
<li>第三条规则：如果方法有 <b>多个</b> <span class="underline">输入生命周期参数</span> ，不过其中之一因为方法的缘故为 <span class="underline">&amp;self</span> 或 <span class="underline">&amp;mut self</span> ，那么 <span class="underline">self 的生命周期</span> 被 <b>赋给所有</b> <span class="underline">输出生命周期参数</span></li>
</ul>
<pre class="example">
第三条规则使得方法更容易读写，因为只需更少的符号
</pre>

<p>
如果编译器 <span class="underline">检查</span> 完这三条规则后仍然 <b>存在</b> <span class="underline">没有计算</span> 出 <span class="underline">生命周期的引用</span> ，编译器将会 <b>停止并生成错误</b> 。这些规则适用于 <span class="underline">fn</span> 定义，以及 <span class="underline">impl 块</span>  
</p>
</div>
<div id="outline-container-orga6b657e" class="outline-4">
<h4 id="orga6b657e">规则应用</h4>
<div class="outline-text-4" id="text-orga6b657e">
<p>
假设我们自己就是编译器。并应用这些规则来计算示例上面的 first_word 函数签名中的引用的生命周期。开始时签名中的引用并没有关联任何生命周期：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">first_word</span>(<span style="color: #4eee94;">s</span>: &amp;<span style="color: #98f5ff;">str</span>) -&gt; &amp;<span style="color: #98f5ff;">str</span> {
</pre>
</div>

<p>
编译器应用第一条规则，也就是每个引用参数都有其自己的生命周期。像往常一样称之为 'a，所以现在签名看起来像这样：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">first_word</span>&lt;'<span style="color: #4eee94;">a</span>&gt;(<span style="color: #4eee94;">s</span>: &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span>) -&gt; &amp;<span style="color: #98f5ff;">str</span> {
</pre>
</div>
<p>
对于第二条规则，因为这里正好只有一个输入生命周期参数所以是适用的。第二条规则表明输入参数的生命周期将被赋予输出生命周期参数，所以现在签名看起来像这样：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">first_word</span>&lt;'<span style="color: #4eee94;">a</span>&gt;(<span style="color: #4eee94;">s</span>: &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span>) -&gt; &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span> {
</pre>
</div>

<pre class="example">
    现在这个函数签名中的所有引用都有了生命周期，如此编译器可以继续它的分析而无须程序员标记这个函数签名中的生命周期
</pre>

<p>
再看看另一个例子，这次从前面中没有生命周期参数的 longest 函数开始：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">longest</span>(<span style="color: #4eee94;">x</span>: &amp;<span style="color: #98f5ff;">str</span>, <span style="color: #4eee94;">y</span>: &amp;<span style="color: #98f5ff;">str</span>) -&gt; &amp;<span style="color: #98f5ff;">str</span> {
</pre>
</div>

<p>
再次假设我们自己就是编译器并应用第一条规则：每个引用参数都有其自己的生命周期。这次有两个参数，所以就有两个不同的生命周期：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">longest</span>&lt;'<span style="color: #4eee94;">a</span>, '<span style="color: #4eee94;">b</span>&gt;(<span style="color: #4eee94;">x</span>: &amp;'<span style="color: #4eee94;">a</span> <span style="color: #98f5ff;">str</span>, <span style="color: #4eee94;">y</span>: &amp;'<span style="color: #4eee94;">b</span> <span style="color: #98f5ff;">str</span>) -&gt; &amp;<span style="color: #98f5ff;">str</span> {
</pre>
</div>

<p>
再来应用第二条规则，因为函数存在多个输入生命周期，它并不适用于这种情况。再来看第三条规则，它同样也不适用，这是因为没有 self 参数
</p>

<pre class="example">
    应用了三个规则之后编译器还没有计算出返回值类型的生命周期
    
    这就是为什么在编译代码时会出现错误的原因：编译器使用所有已知的生命周期省略规则，仍不能计算出签名中所有引用的生命周期
</pre>
</div>
</div>
</div>
